{"Caption":"Figure 2: Map B, used for testing the agent’s virtual sensors.","ImageText":[{"Text":"Room","TextBB":[486.233,398.207,505.154,404.77],"Rotation":0},{"Text":"Corridor","TextBB":[486.233,411.451,511.851,418.013],"Rotation":0},{"Text":"Neither","TextBB":[486.233,424.694,509.099,431.257],"Rotation":0}],"Mention":["in detail. Speciﬁcally, our agent has four actions and a single,\nbinary observation. It is situated in a discrete grid environ-\nment where some cells are open and some are blocked. The\nagent occupies exactly one cell and has four possible orien-\ntations (up, down, left, and right). The agent’s actions are:\ngo forward (F), turn left (L), turn right (R) , and go backward\n(B). If the agent moves forward or backward and collides with\nan obstacle, the agent’s position remains unchanged. At any\ntime step, the agent’s sensor reports 1 if the agent faces a\nblocked cell and 0 otherwise.\nWe chose to make the grid world deterministic: the actions\nalways succeed. Determinism greatly simpliﬁes the perfor-\nmance measures and visualization of our experiments without\nweakening the results.\nWe use two different maps in our experiments. The ﬁrst,\nMap A (Figure 1), has a total of 943 reachable grid locations\nwith four orientations each, for a total of 3,772 states. The\nsecond environment, Map B (Figure 2), has a total of 1,063\nreachable grid locations with four orientations each, for a to-\ntal of 4,252 states.\n","3. ROOM is a feature that is on when the agent is in a room.\nThis is a difﬁcult feature to program manually due to\nthe fact that “room” is a vague human-level concept. In\nour approach we circumvent this problem by simply al-\nlowing a human designer to label certain states as room\nwithout formally deﬁning it (Figures 1 and 2).\n","Map B labeled as not ROOM that look very similar to areas\nin Map A labeled as ROOM. This is evident in the bottom-\nleft and middle-right rooms in Figure 1. Both of these rooms\nhave sections that look locally very much like the double wide\narea from the top of Map B in Figure 2, which is labeled as\nnot ROOM.\n"],"Page":3,"Number":2,"Type":"Figure","CaptionBB":[438,465,773,481],"Height":1100,"Width":850,"DPI":100,"ImageBB":[436,80,778,445]}