{"Caption":"Figure 1: A multi-level ETS representational tower with a single-level sensor at level 0. Reproduced from [Gold- farb et al., 2004]. ","ImageText":[],"Mention":["One of the definitions of the compositionality, adopted in neu-\nroscience [Abeles et al., 2004], states that it is the ability to\nconstruct mental representations hierarchically, in terms of\nparts and their relations. The notion of hierarchical mental\nrepresentations is of paramount importance in the study of\nspeech and language.\nThe ETS formalism has been designed to support the view\nof the environment as formed by a hierarchically evolved —\nand therefore hierarchically organised — dynamic system of\nclasses (of entities). An ETS view of environment is there-\nfore multi-leveled, with the processes at each level composed\nof the ETS primitives, each of which (except for the initial\nlevel), stands for a class from the previous level [Goldfarb et\nal., 2004; Goldfarb, 2004]. In ETS, the level of abstraction\nincreases as one ascends the levels in the hierarchy. The for-\nmalism provides the same formal language for dealing with\neach level of the representation. A useful metaphor for cap-\nturing the hierarchical representation is a multi-level “evolv-\ning representational tower” which can “sense” (and interact\nwith) data only at the initial level (see Figure 1). In this pa-\nper we only deal with the bottommost, articulatory, level of\nrepresentation which corresponds to the sensory level in the\nhierarchy.\nAt the articulatory level of representation, the ETS primi-\ntives (gesture) combine together in different ways to form the\nformative histories (gestural structures) of the speech produc-\ntion process. Semantics of the gestural structure is therefore\ndetermined on the basis of its constituent primitives (some of\nthe examples are given in Section 3).\n"],"Page":2,"Number":1,"Type":"Figure","CaptionBB":[436,304,776,349],"Height":1100,"Width":850,"DPI":100,"ImageBB":[440,72,777,284]}