{"Caption":"Figure 3: The zooming interaction provided by Summary Thumbnails is a semantic zoom: zooming in replaces the abbreviated text with complete text. ","ImageText":[{"Text":"+","TextBB":[593.75,420.704,607.464,450.01],"Rotation":0}],"Mention":["very long column. Figure 1 shows an example. While this \napproach tends to work well for helping users read pages, it \nis of limited use while browsing. Since this approach af-\nfects the layout of pages so significantly, users may find it \nhard to recognize pages familiar from desktop viewing. \n(See the left side of Figure 3 for a better idea of what this \npage looked like before the conversion). This display style \nalso significantly increases the required amount of vertical \nscrolling. As the scrollbar position in Figure 1 indicates, \naccessing the news story that used to be at a prime location \nat  the  top  of  the  page  now           requires scrolling 8 \nscreens  down,  past   what                 used to be the menu \ncolumn of that page. \n","reduction algorithm in detail in the “Implementation” sec-\ntion). When zoomed in, however, Summary Thumbnails \nshow the original, unabbreviated version of the page as \nshown in Figure 3. Zooming interactions involving a \nchange in representation have also been referred to as se-\nmantic zooming [3]. Note that despite the change of repre-\nsentation during this zoom operation, the Summary \nThumbnail and the detail views look similar enough for \nusers to maintain a sense of which areas in the thumbnail \ncorrespond to which areas in the detail view. \n","Interfaces: The participants used three different interfaces: \na Thumbnail interface (Figure 2a), a Single-Column inter-\nface (Figure 1), and a Summary Thumbnail interface \n(Figure 3). All interfaces were displayed on a laptop com-\nputer using a viewer program that offered a net display area \nof 240x320 pixels for actual page content. All three inter-\nfaces allowed participants to scroll vertically through the \nweb pages using the scrollbar. All interfaces fitted web \npages to the screen width to remove the need for horizontal \nscrolling. Thumbnail and Summary Thumbnail interfaces \nwere early design prototypes; while we explained the \nzooming capabilities to the participants, these prototypes \ndid not yet support zooming; zooming support was not \nadded until the quantitative study. \n","In the experiment, participants viewed web pages using the \nfollowing four interfaces: a Thumbnail interface, a Sum-\nmary Thumbnail interface, a Single-Column interface, and \na Desktop interface. The first three were similar to the pro-\ntotypes used in the qualitative study reported earlier, but \nwith additional interaction functionality. In addition to us-\ning the scrollbar, participants could now vertically scroll \nusing keyboard or mouse wheel. The Thumbnail and \nSummary Thumbnail interfaces also allowed participants to \nzoom into a 1:1 scaled view of the original page by click-\ning the respective area in the thumbnail view as shown in \nFigure 3. While zoomed in, participants could scroll the \npage in all four directions by pressing the arrow keys on \ntheir keyboard or by using the scrollbars. The Desktop in-\n"],"Page":2,"Number":3,"Type":"Figure","CaptionBB":[459,585,749,630],"Height":1100,"Width":850,"DPI":100,"ImageBB":[432,241,779,586]}