{"Caption":"Figure 2: The schedule of actions in the experimental game P LANNING II.","ImageText":[],"Mention":["2. an abductive planner. This method builds a search\ntree, consisting of nodes representing actions and\narcs representing a post-\/precondition relationship\nbetween these actions (similar to figure 2). It then\nstarts at the root of this tree and finds an action that\n(1) is currently executable and (2) contributes the\nmost to the goal of the game. The latter should\nbe determined using domain knowledge, namely a\nheuristic that provides the required information.\n","We will now provide a more detailed analysis of the\ngame developed for one particular experiment, namely\nthe game labelled PLANNING II in [de Jong, 2004].\nThe game is reminiscent of the FACTORY game dis-\ncussed earlier. The player must build housing and fac-\ntories. The location of these buildings does not effect\nthe game’s progress – only the quantity is a factor of\ninfluence. There are two types of factories, viz. coal-\noperated factories and electricity-operated factories – the\nlatter are more enhanced and produce more output (i.e.,\nmore money). In order to be able to build enhanced fac-\ntories, the player must first build a power plant, which\nis an expensive building. In addition to building new\nenhanced factories, it is also possible to refit existing\nnormal, coal-operated factories, which then become en-\nhanced ones. A schedule of actions and preconditions in\nthis game is represented in figure 2. For example, the\nfigure shows that in order to build a normal (factory), a\nplayer must acquire 5 pieces of land and 2 houses, and\nmust invest 9 euros. The goal of the game is to make as\nmuch money as possible within a given number of turns,\nfor example 300, with a given amount of money in the\nfirst round, for example 50 euros.\n"],"Page":5,"Number":2,"Type":"Figure","CaptionBB":[216,310,632,324],"Height":1100,"Width":850,"DPI":100,"ImageBB":[235,100,614,293]}