{"Caption":"Figure 2: For a destination D, P 1 may prefer to export to C1 a path through P 2 over a path through C2. ","ImageText":[{"Text":"peers","TextBB":[603.207,481.277,638.413,491.066],"Rotation":0},{"Text":"P1","TextBB":[553.151,492.154,570.771,501.943],"Rotation":0},{"Text":"P2","TextBB":[692.196,492.154,709.816,501.943],"Rotation":0},{"Text":"C1","TextBB":[503.094,546.537,522.566,556.327],"Rotation":0},{"Text":"C2","TextBB":[592.083,546.537,611.555,556.327],"Rotation":0},{"Text":"C3","TextBB":[547.589,590.044,567.061,599.834],"Rotation":0},{"Text":"S","TextBB":[553.151,637.177,562.428,646.966],"Rotation":0},{"Text":"C4","TextBB":[647.701,590.044,667.173,599.834],"Rotation":0},{"Text":"D","TextBB":[603.207,640.803,615.254,650.592],"Rotation":0}],"Mention":["believe that, in the future, such local constraints alone\nmay not satisfy the requirements of ASs. We illustrate\nthis using the provider-customer directed graph shown\nin Figure 2. The link between Provider P1 and its cus-\ntomer C2 is congested. To alleviate this congestion, P1\nwould like tra\u000Ec to destination D from S to transit P2,\nand not C2. The scenario described above requires P1\nto violate the local constraints above and prefer a longer\npeer route over a customer route.\nObserve that, in the long term, P1 in Figure 2 may\n\fnd it economically advantageous to upgrade the link to\nC2. However, until that time, it might have to resort to\nchoosing P2, if possible. This motivates us to consider\nthe possibility of small deviations from local constraints.\nSpeci\fcally, for each destination D, policy safety might\n","be ensured even if a small number of ASs violate one\nor more of the local constraints. For instance, the sys-\ntem in Figure 2 is convergent if P1 alone deviates from\nthe second policy constraints. To see this, consider the\ne\u000Bect of P1 changing its policy from preferring C2 to\nP2. The e\u000Bect of this change would be:\n"],"Page":4,"Number":2,"Type":"Figure","CaptionBB":[438,671,772,719],"Height":1100,"Width":850,"DPI":100,"ImageBB":[494,481,718,655]}