{"Caption":"Figure 5. Test variables that failed after the first design                          change ","ImageText":[],"Mention":["In Figure 4, one can observe a very interesting phenomenon.  \nSome variables, e.g., 18 and 19, fail the tests after the first design \nmodification, and their values remain in the failure range after \nthat. The user can specify a query function on the failure pattern \nto see if any other test variables display a similar pattern. Figure 5 \nshows the results of this query. In Figure 5, the values are \nreordered along the horizontal axis according to their similarity to \nthe query variable. From the main visualization window, one can \nsee that the first fourteen test variables have the same patterns. \nFrom the trend figures on top, it is clear that they fail all the tests \nexcept the first one. This reveals that during the first design \n","If one scrolls the visualization shown in Figure 5 to the right, one \nwould see a different set of variables, as shown in Figure 6. \nImportant features in this part of the visualization include the fact \nthat the values of test variables 40 through 50 fluctuate a great \ndeal. This means that many design changes can affect these \nvariables' values and should prompt the user to study the \nassociated portions of the circuit designs to find the underlying \nreasons for this fluctuation.  \n","Although the queries, whose results were shown in Figures 4, 5, \nand 7, were performed for patterns that the user knew a priori to \nexist in the data, it is possible to use V-Miner to query the data for \nany arbitrary pattern. For example, one may wish to know \nwhether any design modification can bring a test variable from \nfail back to normal. The user can issue the query for this failure \npattern using the query string of “FO”, where “F” stands for \nfailure, and “O” stands for normal. The system will display the \nvariables sorted according to the query string. The results in \nFigure 8 show that design changes with corresponding “FO” test \n"],"Page":6,"Number":5,"Type":"Figure","CaptionBB":[459,939,756,970],"Height":1100,"Width":850,"DPI":100,"ImageBB":[440,682,777,930]}