{"Caption":"Figure 3. The street map provided to participants in Study 1 (left) and one of the fully connected graphs provided to participants in Study 2 (right). ","ImageText":[],"Mention":["To explore how groups work over spatially fixed data sets, \nwe designed a map-based route creation task requiring \ncollaborative visualization.  Pairs created two separate bus \nroutes in a map of a fictitious city (Figure 3, left).  Beyond \nsimply creating routes to connect designated end points, \nparticipants were to optimize their routes based on a set of \nconstraints, ensuring that created routes: (1) were \nreasonably direct, (2) traveled along preferred streets, (3) \npassed through residential and commercial zones while \n","avoiding industrial zones, and (4) avoided overlapping with \neach other.  Various data layers including the street map, \n“preferred streets,” and locations of residential, industrial, \nand commercial zones were provided to groups to help \nthem construct routes (Figure 3, left).  These data layers \nwere accessible to participants via combinations of filters, \nlenses and ShadowBoxes, depending on the study condition \nthey were completing (see Design). \n","Pairs found routes in a fully connected graph (114 nodes, \n218 edges; Figure 3, right) covering the entire workspace.  \nThis task represented an abstract route planning task (such \nas airline routes).  Two independent data overlays provided \nedge weight information (“travel time” and “financial \ncost”), where the weights could be 1, 2 or 3.  Participants \ngenerated routes to connect four specific nodes on the \ngraph.  Depending on the condition, each participant was \nresponsible for generating one of two independent routes \n(one for travel time, one for financial cost), or the pair was \nresponsible for a single, group compromise route (taking \ninto account both travel time and financial cost).  We also \nvaried the visual tool pairs used: global filters, or the \nredesigned lenses. \n"],"Page":4,"Number":3,"Type":"Figure","CaptionBB":[83,306,763,334],"Height":1100,"Width":850,"DPI":100,"ImageBB":[120,86,721,291]}