{"Caption":"Figure 2: Toy example of sparsifying rectification produced by the Sparsifying Logistic for different choices of the parameters η and β. The input is a sequence of Gaussian random variables. The output, computed by using eq. 4, is a sequence of spikes whose rate and amplitude depend on the parameters η and β. In particular, increasing β has the effect of making the output approximately binary, while increasing η increases the firing rate of the output signal. ","ImageText":[{"Text":"¼","TextBB":[217.14,371.839,223.897,382.17],"Rotation":0},{"Text":"¼½","TextBB":[227.676,371.839,241.191,382.17],"Rotation":0},{"Text":"¬","TextBB":[265.815,370.944,273.374,382.5],"Rotation":0},{"Text":"¿¼","TextBB":[274.175,371.839,287.69,382.17],"Rotation":0},{"Text":"¼","TextBB":[367.404,371.839,374.162,382.17],"Rotation":0},{"Text":"½","TextBB":[377.941,371.839,384.698,382.17],"Rotation":0},{"Text":"¬","TextBB":[416.198,370.944,423.757,382.5],"Rotation":0},{"Text":"¿¼","TextBB":[424.558,371.839,438.073,382.17],"Rotation":0},{"Text":"¼","TextBB":[517.786,371.839,524.543,382.17],"Rotation":0},{"Text":"½","TextBB":[528.322,371.839,535.08,382.17],"Rotation":0},{"Text":"¬","TextBB":[570.813,370.944,578.373,382.5],"Rotation":0},{"Text":"½¼","TextBB":[579.174,371.839,592.689,382.17],"Rotation":0}],"Mention":["can be seen by unrolling the recursive equation in 4. This non-linearity can be easily understood as\na weighted softmax function applied over consecutive samples of the same code unit. This produces\na sequence of positive values which, for large values of β and small values of η, is characterized\nby brief and punctuate activities in time. This behavior is reminiscent of the spiking behavior of\nneurons. η controls the sparseness of the code by determining the “width” of the time window over\nwhich samples are summed up. β controls the degree of “softness” of the function. Large β values\nyield quasi-binary outputs, while small β values produce more graded responses; fig. 2 shows how\nthese parameters affect the output when the input is a Gaussian random variable.\n"],"Page":3,"Number":2,"Type":"Figure","CaptionBB":[148,451,700,521],"Height":1100,"Width":850,"DPI":100,"ImageBB":[203,371,646,426]}