{"Caption":"Figure 6: Iris outline template composed of left, right, upper and lower sub templates. Position parameters le-p, ri-p, up- p and ro-p are used to control this template. ","ImageText":[{"Text":"up-p","TextBB":[245.663,448.709,263.276,457.453],"Rotation":0},{"Text":"upper","TextBB":[264.596,459.951,286.475,468.695],"Rotation":0},{"Text":"left","TextBB":[193.451,469.012,202.195,481.821],"Rotation":3},{"Text":"le-p","TextBB":[179.814,498.664,194.755,507.408],"Rotation":0},{"Text":"ri-p","TextBB":[295.617,514.558,309.492,523.302],"Rotation":0},{"Text":"right","TextBB":[286.538,537.132,295.282,555.283],"Rotation":3},{"Text":"lower","TextBB":[200.25,555.29,222.129,564.034],"Rotation":0},{"Text":"lo-p","TextBB":[225.227,567.755,240.706,576.499],"Rotation":0}],"Mention":["The subscripts left and right are specifying the sub tem-\nplates of the iris outline template shown in Fig. 6. The po-\nsitions parameters ri-p and le-p are associated the used sub\ntemplates.\n","Subscripts left, right, upper and lower are specifying the\nsub templates of the iris outline template shown in Fig. 6.\nThe subscripts horizontal and vertical are used to label the\nusage of the horizontal and vertical templates shown in\nFig. 7. The subscripts upper2 and lower2 are the upper and\nlower sub templates of the horizontal and vertical templates.\nThe elements of the eye center localization cost function\nare horizontal gradients for the iris-eyeball boundary using\nthe left and right sub templates shown in Fig. 6, vertical\ngradients for the iris-eyelid boundary using the upper and\nlower sub templates shown in Fig. 6, correlations of sub\nimages with the horizontal and vertical templates as well as\nthe horizontal gradients using the second version of the up-\nper and lower sub templates shown in Fig. 7. In order to\ndetermine the horizontal and vertical correlation results the\nluminance values of the iris-pupil disk and the surrounding\nsub template areas are estimated for each search position in\norder to minimize the difference of synthesized horizontal\nas well as vertical templates to the search image. Each el-\nement of the cost function has an equal weight in the cost\nfunction.\n","Each template consists of several sub templates. Size and\nposition are the parameters, on which the sub templates de-\npend on each other.\nThe iris outline template, which is used in the eye cen-\nter localization procedure consists of four sub templates and\napproximates the circular iris-pupil disk as a rectangle. The\niris-pupil disk can be partly covered by the upper and lower\neye lid. In order to take these occlusions into account, the\nupper and lower eye lid are approximated as straight lines.\nThese four sub templates are shown in Fig. 6 and called\nleft, right, upper and lower sub template. Each sub tem-\nplate has the capability to change the position independent\nof the other sub templates. Therefore four position parame-\nters are used to control the iris outline template. These four\nparameters are le-p (left position), ri-p (right position), up-\np (upper position) and lo-p (lower position). The size of\nthe left and right sub template depends on all four position\ntemplates. The size of the upper and lower sub templates\ndepends only on the position parameters of the left and right\nsub template.\n"],"Page":5,"Number":6,"Type":"Figure","CaptionBB":[79,598,409,646],"Height":1169,"Width":826,"DPI":100,"ImageBB":[178,448,311,579]}