{"Caption":"Figure 1: Road network and car traffic in NE Switzerland. ","ImageText":[],"Mention":["Since real vehicular traces are not available, a traffic sim-\nulator can be used to generate the movement of vehicles.\nHowever, driver behavior on a road is very complex. Driv-\ning is interactive, drivers must react to changing road con-\nditions. Road conditions (e.g., congestion) depend in turn\non the drivers’ plans and behaviors. Thus, the choice of\nthe traffic simulator in the end influences the relevance and\nviability of the obtained results.\nVehicular traffic simulators can in general be classified\ninto microscopic and macroscopic simulators. A macro-\nscopic simulator considers such system parameters as traffic\ndensity (number of vehicles per km per lane) or traffic flow\n(number of vehicles per hour crossing some point, usually\nintersection) to compute road capacity and the distribution\nof the traffic in the road net. From the macroscopic per-\nspective, vehicular traffic is viewed as a fluid compressible\nmedium, and, therefore, is modeled as a special derivation of\nthe Navier-Stokes equations. In contrast, microscopic simu-\nlators determine the movement of each vehicle that partici-\npates in the road traffic. Thus, a microscopic traffic simula-\ntor is potentially a better choice for our research.\nThe multi-agent traffic simulator developed at ETH Zurich\nis capable of simulating public and private traffic over real\nregional road maps of Switzerland with a high level of real-\nism. MMTS models the behavior of people living in the area,\nreproducing their movement (using vehicles) within a period\nof 24 hours. The decision of each individual depends on the\narea it lives in. The individuals in the simulation are dis-\ntributed over the cities and villages according to statistical\ndata gathered by a census. Within the 24 hours of simula-\ntion, all individuals choose a time to travel and the mean\nof transportation according to their needs and environment.\nE.g., one individual might take a car and go to work in the\nearly morning, another one wakes up later and goes shop-\nping using public transportation, etc. Travel plans are made\nbased on road congestion; congestion in turn depends on the\ntravel plans. To resolve this situation a standard relaxation\nmethod is used.\nThe street network that is used in MMTS was originally\ndeveloped for the Swiss regional planning authority (Bunde-\nsamt fu¨r Raumentwicklung). The major attributes of each\nroad segment are type, length, speed, and capacity. The\nstreet network is simulated on a Beowulf Pentium cluster of\nup to 30 CPUs. With the help of MMTS, the consequences\nof construction sites, road modifications, new roads, etc. can\nbe simulated and potential economical influence (e.g., travel\ntime and price changes for public and private transport) can\nbe estimated.\nFor the evaluation of inter-vehicle routing schemes, we use\na 24 hour detailed car traffic trace file generated by MMTS.\nThe file contains detailed simulation of the area in the can-\nton of Zurich, this region includes the part where the main\ncountry highways connect to the city of Zurich, the largest\ncity in Switzerland. Around 260’000 vehicles are involved in\nthe simulation with more than 25’000’000 recorded vehicles\ndirection\/speed changes in an area of around 250 km x 260\nkm (Figure 1).\nThe car traffic simulator file describes in XML format the\nstep by step movement of each vehicle within the 24 hour\ntime period. To use that data we convert the XML input\nfrom the car traffic simulator into an ns-2 simulator move-\nment pattern in Tcl format [14,16]. Each run of the simula-\n"],"Page":3,"Number":1,"Type":"Figure","CaptionBB":[73,287,407,315],"Height":1169,"Width":827,"DPI":100,"ImageBB":[111,73,369,259]}