{"Caption":"Figure 2. The ECho Framework","ImageText":[{"Text":"System","TextBB":[613.333,589.682,645.837,603.138],"Rotation":0},{"Text":"C","TextBB":[648.666,589.682,656.1,603.138],"Rotation":0},{"Text":"System","TextBB":[463.333,602.182,495.837,615.638],"Rotation":0},{"Text":"A","TextBB":[498.833,602.182,506.88,615.638],"Rotation":0},{"Text":"System","TextBB":[488.333,716.015,520.837,729.471],"Rotation":0},{"Text":"B","TextBB":[523.666,716.015,531.1,729.471],"Rotation":0},{"Text":"E-Code","TextBB":[636.5,741.849,670.615,755.305],"Rotation":0},{"Text":"Operator","TextBB":[673.333,741.849,712.878,755.305],"Rotation":0}],"Mention":["lightweight distributed virtual entities managing data \ntransmitted by middleware components at stream sources \nand sinks. An example system is shown in Figure 2. The \ntraffic for individual channels is multiplexed over shared \ncommunication links by aggregating the traffic of \nmultiple streams into a single stream linking the two \ncommunicating addresses.   \n We follow the semantics of a publish-subscribe system \nin order to ensure that multiple sinks can \nsubscribe\/unsubscribe to a stream channel depending on \ntheir requirements, and that the channels survive even \nwhen there are no subscribers (although in that case no \nactual data is streamed). The publish-subscribe system \nalso proves useful when many sinks have similar data \nfiltering needs; in such a scenario, a single channel \nderived using a data transformation operator can fill the \nneeds of all the sinks.  \n The data-operator in our infrastructure is typically a \nsnippet of code written in a portable subset of C called \n“E-Code”. This snippet is transported as a string to the \nnode where it has to be deployed. At the target-node, the \ncode snippet is parsed, and native code is generated. The \nimplicit context in which the code is executed is a \nfunction declaration of the form: \n"],"Page":3,"Number":2,"Type":"Figure","CaptionBB":[526,775,691,793],"Height":1100,"Width":850,"DPI":100,"ImageBB":[451,582,743,775]}