{"Caption":"Figure 2. Global vs. local\/banded optimization in 2D shape reconstruction. We minimize a functional similar to (1) or (11). The data term of the energy is based on pixels’ potentials (a): dark – negative, bright – positive, gray – zero. The regularization term is geometric length of the shape’s boundary. Image (c) shows results of local optimization (level sets) from initial solution (b). Global optimization (graph-cut on a full-size 2D grid) is in (d). Our method detects such global minima using a small subgraph (e) automatically grown from a narrow-band around the same initial shape (b). ","ImageText":[{"Text":"a)","TextBB":[110.253,309.984,121.005,322.437],"Rotation":0},{"Text":"Data","TextBB":[124.464,309.984,150.589,322.437],"Rotation":0},{"Text":"term","TextBB":[154.048,309.984,179.413,322.437],"Rotation":0},{"Text":"b)","TextBB":[241.128,309.984,252.654,322.437],"Rotation":0},{"Text":"Initial","TextBB":[256.114,309.984,289.158,322.437],"Rotation":0},{"Text":"shape","TextBB":[292.617,309.984,324.125,322.437],"Rotation":0},{"Text":"c)","TextBB":[360.85,309.984,371.602,322.437],"Rotation":0},{"Text":"Local","TextBB":[375.061,309.984,406.569,322.437],"Rotation":0},{"Text":"optimization","TextBB":[410.028,309.984,479.991,322.437],"Rotation":0},{"Text":"d)","TextBB":[495.184,309.984,506.711,322.437],"Rotation":0},{"Text":"Global","TextBB":[510.17,309.984,547.836,322.437],"Rotation":0},{"Text":"optimization","TextBB":[551.295,309.984,621.258,322.437],"Rotation":0},{"Text":"e)","TextBB":[633.573,309.984,644.311,322.437],"Rotation":0},{"Text":"Subgraph","TextBB":[647.77,309.984,700.81,322.437],"Rotation":0},{"Text":"(in","TextBB":[704.269,309.984,719.642,322.437],"Rotation":0},{"Text":"white)","TextBB":[723.102,309.984,758.457,322.437],"Rotation":0}],"Mention":["Fig.12. In practice, we produce good results even using di-\nrections towards the sensor\/camera which are often known\nfor data points (blue or green arrows in Fig.1) .\n","tion volumes. Standard hierarchical or narrow band tech-\nniques do not guarantee global minima and generally be-\nhave as local optimization methods, see Fig.2,3. In contrast,\nour new memory-efficient graph-cut algorithm guarantees\nglobal minima. It can compute global minima surfaces at\nfairly high resolutions on regular PCs. In the context of\nsurface fitting problem, our technique computes regularized\nwatertight surfaces demonstrating good alignment to data\npoints without over-fitting to outliers. Our memory efficient\ngraph-cut algorithm may potentially be generalized to other\noptimization problems in computer vision.\n","ous surface functionals using regular N-neighborhood grids\nwith specific edge weights. The optimal surface is implic-\nitly represented by the minimum cut. As grid resolution and\nconnectivity increase, this discrete approximation becomes\nmore accurate. In contrast to local variational methods,\ngraph-cut approach yields a global minimum (Figure 2d)\nand it is not sensitive to initialization. On the negative side,\ncurrent min cut algorithms require a lot of memory when\nused on high resolution grids.\n","Commonly used geometric functionals are non-convex\nand may have many local extrema. Consequently, the par-\nticular choice of optimization method is important. One\npopular surface optimization approach is based on varia-\ntional methods using deformable meshes or implicit level\nset representation of the shape. However, variational meth-\nods find local minima which may depend on initialization\nand on numerical implementation details (Figure 2a-c).\n","The objective of this paper is to develop a global op-\ntimization framework for 3D shape fitting problems. To\ndevelop this framework, we first propose a novel continu-\nous geometric functional for surface-to-data fit (see Sec.3).\nOur flux-based functional is amenable to global (e.g. graph-\ncut) or local (e.g. level-set) optimization methods. Essen-\ntially, we maximize the number of points that lie on a sur-\nface constrained by a shape prior. Yet, local optimization of\nour functional is sensitive to initialization (Fig.2b,c) while\nglobal optima solution is consistent (Fig.2d).\n","small part of the volume. We would like to restrict com-\nputations to a subgraph (e.g. narrow band), i.e. some part\nof the grid surrounding the actual data points. Yet, exist-\ning narrow-band strategies [22, 16] do not guarantee global\noptimality making the result depend on the actual shape of\nthe narrow band and on initial guess. Essentially, previ-\nous narrow-band techniques converted graph-cut into a lo-\ncal optimizer similar to level-sets or other variational meth-\nods causing local minima problems, e.g Fig.3 (middle).\nIn order to retain global optimality, in Section 4.1 we\nprove a lemma that relates a minimum cut on a subgraph\nto the minimum cut on the complete graph. Based on this\nlemma, we propose a memory efficient graph-cut algorithm\nthat automatically adjusts the shape of the subgraph until\nits minimum cut is guaranteed to coincide with the mini-\nmum cut in the whole volume. This allows computation of a\nglobally optimal minimum cut using a subgraph (Fig. 2d,e).\nOur surface fitting experiments showed that our algorithm\ncan compute globally optimal cuts using an order of mag-\nnitude less memory than what normally would be required\nfor a full resolution graph. These memory savings resulted\nin a leap forward in resolution at which globally optimal\nsurface can be computed significantly increasing accuracy\nof shapes generated by local optimization (see Fig.2) or by\nstandard narrow-band methods (see Fig.3).\nExperiments show that our shape fitting method recon-\nstructs high-resolution watertight surfaces in presence of\nnoise, outliers, large missing parts, and varying sampling\ndensity. Global optimality of our surface fitting solutions\nimplies no initialization issues, better robustness, consis-\ntency, and possibly wider scope of applications.\n","As shown in Figure 9(a), the data (or non-zero t-links)\nmay concentrate in a very small subset of the domain of in-\nterest. It may look good enough to consider optimization in\na band containing all the data, but this converts graph-cut\ninto a local optimization technique (like level-sets). As was\nshown in Figure 2, this makes surface reconstruction very\n","This algorithm always yields the globally minimal cut.\nHowever, the size of B and the number of iterations de-\npends on the accuracy of the initialization. This behaviour\nis different from the local optimization methods, where both\nresult and consumed resources depend on the accuracy of\ninitialization, see Figure 2. Note, although we used level\nsets to get the results in Figure 2(c), any other local op-\ntimization method (inc. snakes, banded graph-cut) would\nperform similarly.\n","We also compared the results of our method with Pois-\nson surface reconstruction recently proposed in [17]. There,\nit was demonstrated to compare favourably to several other\nstate-of-the-art methods. For a less challenging dataset with\naccurate normal orientations it produced the results equally\ngood to ours (Figure 12, right two images). However, it\nwas unable to handle original raw scans dataset with coarse\norientation estimates, whereas our method produced a rea-\nsonable results (Figure 12, left two images).\n"],"Page":2,"Number":2,"Type":"Figure","CaptionBB":[68,324,757,398],"Height":1100,"Width":850,"DPI":100,"ImageBB":[75,147,765,324]}