{"Caption":"Figure 2. Top-left: A range image, where the pixel values corre- spond to a distance. Top-middle: A difference range image used for motion detection. Top-right: The resulting motion detected in 2D after hysteresis bandpass filtering and creation of a double dif- ference image. Bottom-left: An intensity image. Bottom-middle: A difference intensity image used for ROI selection. Bottom-right: The resulting ROI in 2D after hysteresis highpass filtering and cre- ation of a double difference image. ","ImageText":[],"Mention":["ing the depth values pixelwise in two pairs of depth images\n(see figure 2 (top-middle)), thresholding and finally AND-\ning the two binary images. The moving arms (and their\nshadows) are visible in the binary image, but so is a large\namount of noise due to erroneous depth values often pro-\nduced by the SwissRanger camera. To handle these noise\neffects, each of the two 3D difference images is filtered with\na hysteresis bandpass filter before they are ANDed together\n(see figure 2 (top-right)). This filter operates in 2D and uses\n","We capture intensity and 3D data using a CSEM Swiss-\nRanger SR-2 range camera (see figure 1) [13]. The cam-\nera is based on the Time-Of-Flight principle and emits\nradio-frequency modulated light in the near-infrared spec-\ntrum, which is backscattered by the scene and detected by\na CMOS CCD. The resolution is 160 × 124 pixels with an\nactive range of 7.5 m. The depth accuracy is typically in the\norder of a few centimeters, depending of the distance range\nand illumination. Figure 2 (top-left) and figure 2 (bottom-\nleft) show a range and an intensity image of one time instant\nof a ”point right” gesture, respectively.\n","The idea is, that the ROI estimated in the intensity im-\nage will not include these falsified distance measurements.\nWhen detecting motion in the range image, the errornous\ndistance values will cause false motion effects. As a result\nthese false motion pixels will be mapped to 3D and hereby\ninclude data points with incorrect distances. In contrast the\nintensity information do not suffer from this problem. Al-\nthough it should be noted, that the camera produces inten-\nsity images of very low quality, and therefore this type of\ndate is not used for motion detection on its own but solely\nfor ROI selection.\nThe ROI is estimated by the same technique used to ex-\ntract motion in the range data, namely image differencing.\nAgain we create a double difference image by subtracting\nthe values pixelwise in two pairs of intensity images (see\nfigure 2 (bottom-middle)), thresholding and ANDing the\ntwo binary images. Noise is handled like before by a hys-\nteresis filter. However, in this case we are interested in the\npixels including the largest differences. Hence, as opposed\nto the other bandpass filter, this filter operates as a highpass\nfilter with two thresholds (see figure 2 (bottom-right)). Fig-\nure 3 (bottom) shows an example of the 3D point cloud after\nthe intensity based ROI slection has been applied. The fig-\nure illustrates how effective the ROI eliminates data points\nwith incorrect distances, and hence how the two data types\ncompliment each other.\n"],"Page":2,"Number":2,"Type":"Figure","CaptionBB":[427,529,757,649],"Height":1100,"Width":850,"DPI":100,"ImageBB":[427,354,759,527]}