{"Caption":"Figure 3: (a) A gumstix-based Nike+iPod surveillance device with wireless Internet capabilities. (b) Our Nike+iPod Receiver to USB adapter ","ImageText":[],"Mention":["The Nike+iPod Sport Kit allows runners and walkers to\nhear real time workout progress reports on their iPod\nNanos. A typical user would purchase an iPod Nano,\na Nike+iPod Sport Kit, and either a pair of Nike+ shoes\nor a special pouch to attach to non-Nike+ shoes. The\nkit consists of a receiver and a sensor. Users place the\nsensor in their left Nike+ shoe and attach the receiver\nto their iPod Nano as shown in Figure 2. The sensor is\na 3.5cm x 2.5cm x 0.75cm plastic encased device, and\nthe receiver is a 2.5cm x 2cm x 0.5cm plastic encased\ndevice. When a person runs or walks the sensor begins\nto broadcasts sensor data via a radio transmitter whether\nor not an iPod Nano is present. When the person stops\nrunning or walking for ten seconds, the sensor goes to\nsleep. When the iPod Nano is in workout mode and the\nreceiver’s radio receives sensor data from the sensor, the\nreceiver will relay (a function of) that data to the iPod\nNano, which will then give audio feedback (via the iPod\nheadphones) to the person about his or her workout. As\nof September 2006, Apple has sold more than 450,000\nof the $29 (USD) Nike+iPod Sport Kits [1].\n","• Receiver to USB Adaptor. We created a compact\nUSB receiver module for connecting the Nike+iPod\nreceiver to a computer via USB. Our module does not\nrequire any modification to the Nike+iPod receiver;\nsee Figure 3b, and consists of a female iPod connec-\ntor [23] and a serial-to-USB board utilizing the FTDI\nFT2232C chipset [14]. We connected the serial pins\nand power pins of the iPod connector to the appro-\npriate pins of the FT2232C board. When this module\nis connected to a computer, the receiver is then pow-\nered and a USB serial port is made available for our\nsoftware to communicate with the receiver. With the\nreceiver attached, this package is approximately 3cm\nx 3cm x 2cm.\n","• Gumstixs. We also implemented a cheap Nike+iPod\nsurveillance device using the Linux-based gumstix\ncomputers. This module consists of an unmodi-\nfied $29 Nike+iPod receiver, a $109 gumstix connex\n200xm motherboard, a $79 wifistix, a $27.50 gum-\nstix breakout board, and a $2.95 female iPod connec-\ntor. The Nike+iPod receiver is connected directly to\nthe gumstix’s serial port, thereby eliminating the need\nfor our serial-to-USB adaptor. The assembled pack-\nage is 8cm x 2.1cm x 1.3cm and weighs 1.1 ounces;\nsee Figure 3a.\n"],"Page":3,"Number":3,"Type":"Figure","CaptionBB":[436,231,751,279],"Height":1100,"Width":850,"DPI":100,"ImageBB":[435,97,753,215]}