{"Caption":"Figure 1: Yarn-level cloth: Three knitting patterns relaxed to rest in our simulator. Each starts from a flat input configuration like at left; they differ only in their interlocking patterns. Characteristic shapes and textures of each knit emerge from our yarn-level physical model. ","ImageText":[],"Mention":["The first stage of computation, before we begin simulating motion,\nis relaxing the models from their initial configuration to a rest state.\nIn this process the models, which initially differ only in the orien-\ntation of the loops, take on the characteristic shapes and textures\nassociated with these patterns in real knits. The relaxed models are\nshown in Figure 1, and the small-scale structures of the three mod-\nels before and after relaxation are shown in Figure 7.\n","All of the real samples were knitted (by the first author) using wool\nworsted size 8 yarn, with each row knitted using alternating col-\nors so that the knit structure is more readily apparent. The weight\nand diameter of this yarn was used as input parameters to our yarn\nmodel. Each sample consists of 42 rows, with each row containing\n32 stitches. Figure 1 illustrates the results of using our model to\nrelax an initial configuration into a default rest state for the three\nsamples, while Figure 3 shows their real-life equivalents. Other\nthan the placement of knit and purl stitches according to the model’s\nknit pattern, all of the other parameters for the three models were\nidentical. Our yarn-based model accurately predicts the curling on\nthe edges of the stockinette, as well as the compression of the rib\nknit in the course direction and the garter knit in the wale direc-\ntion. These properties arose naturally from the interactions of the\nyarn in our model; in comparison, to achieve the same effect in an\nelastic model would require careful manual tweaking of rest angles\ncustomized for each particular knit.\n","Finally, Figure 11 shows our largest example, a 20 × 400 scarf\ncomposed of 64,690 spline segments falling on an inclined plane.\nThe full movie of the sequence appears in the SIGGRAPH 2008\nComputer Animation Festival [Kaldor et al. 2008].\n"],"Page":1,"Number":1,"Type":"Figure","CaptionBB":[73,300,775,327],"Height":1100,"Width":850,"DPI":100,"ImageBB":[75,179,776,295]}