{"Caption":"Figure 4. Comparison of different reconstruction schemes. (a) Visual hull. (b) The result obtained from static space carving. The difficult geometry between the arms is slightly improved. (c) An al- most optimal reconstruction is achieved by our algorithm. ","ImageText":[{"Text":"(a)","TextBB":[162.987,541.471,175.264,551.434],"Rotation":0},{"Text":"Visual","TextBB":[178.026,541.471,206.211,551.434],"Rotation":0},{"Text":"hull","TextBB":[208.998,541.471,226.201,551.434],"Rotation":0},{"Text":"(b)","TextBB":[372.288,541.471,385.195,551.434],"Rotation":0},{"Text":"Space","TextBB":[387.945,541.471,414.335,551.434],"Rotation":0},{"Text":"carving","TextBB":[417.122,541.471,450.286,551.434],"Rotation":0},{"Text":"result","TextBB":[453.049,541.471,477.601,551.434],"Rotation":0},{"Text":"(c)","TextBB":[625.562,541.471,637.839,551.434],"Rotation":0},{"Text":"Our","TextBB":[640.601,541.471,657.803,551.434],"Rotation":0},{"Text":"result","TextBB":[660.566,541.471,685.118,551.434],"Rotation":0}],"Mention":["be. Only when we employ the full algorithm which takes\ninto account temporal coherence between the geometry of\nthe frames do we get the satisfactory result in Fig. 4 on the\nright.\n","In order to test our algorithm, we run it on real-world\n320 £ 240 RGB video sequences of a ballet dancer. All in-\nput images are segmented into foreground and background\nusing a thresholding technique. Consequently, we can com-\npute the refined visual hull to get a starting volume for the\nPDE evolution, Fig. 3. For our test runs, we choose a 20\nframe long part of the sequence with the depicted frame in\nthe middle. As becomes apparent in Fig. 4, this frame is\nparticularly difficult to reconstruct, because we do not have\na camera capturing the scene from above. For that reason,\nmost of the area in between the arms of the dancer is not\ncarved away in the initial surface.\nWhen we run a standard space-carving algorithm for this\nsingle frame alone, the situation improves. The shirt of the\ndancer contains not much texture information, however, so\nonly part of the critical region is carved away as it should\n"],"Page":6,"Number":4,"Type":"Figure","CaptionBB":[96,558,752,606],"Height":1100,"Width":850,"DPI":100,"ImageBB":[79,299,771,554]}