{"Caption":"Figure 4: Example of a reconstructed root (detail): false positives, false negatives, and diameter estimates. (a) Raw data at SNR 150, (b) tubular structures enhanced using Eqn. (1), (c) extracted structure model before subvoxel positioning, (d) true and fitted structure model overlayed, with missing\/additional pieces marked in strong red\/blue, (e) diameter estimates, (f) mass estimates. ","ImageText":[{"Text":"(a)","TextBB":[145.04,258.977,160.399,271.347],"Rotation":0},{"Text":"(b)","TextBB":[326.872,258.977,343.006,271.347],"Rotation":0},{"Text":"(c)","TextBB":[512.164,258.977,527.523,271.347],"Rotation":0},{"Text":"(d)","TextBB":[146.769,424.898,162.903,437.268],"Rotation":0},{"Text":"(e)","TextBB":[328.603,424.898,343.962,437.268],"Rotation":0},{"Text":"(f)","TextBB":[510.435,424.898,524.258,437.268],"Rotation":0}],"Mention":["For quantitative analysis of our reconstruction algo-\nrithm, we use synthetic data of maize roots (see Sec. 3).\nFig. 4 shows a typical detail view of such data at\nSNR 150. At this SNR Frangi’s tubularness mea-\nsure (Eq. (1), Fig. 4b) gives a reasonable indication of\nwhere the root is. Figs. 4c, d show the found positions\n","before and after subvoxel positioning. In Fig. 4d we\nsee that most parts of the root system are correctly\ndetected, however, at junctions and crossings the algo-\nrithm sometimes prefers shortcuts over the true root\npath. For root length the effect has not much influence,\nhowever branching angles are slightly biased towards\n90◦. In addition, as short (< 3mm) root elements are\nsuppressed for the sake of robustness with respect to\nnoise and uncorrect skeletonization of thick roots, true\nshort root elements are non-surprisingly missing.\n","Diameter and mass of the roots are shown in\nFig. 4e, f, where in Fig. 4e diameter is estimated from\nthe Frangi scales (Eq. 2), and in Fig. 4f diameter is cal-\nculated from the estimated mass (by inverting Eq. 3).\nWe observe that radius from mass, i. e. from the mea-\nsured image intensities, is much more reliable than the\ngeometry-based estimate—especially for smaller roots.\nHowever, this is only possible under the assumption\nof constant water density in the root, being perfectly\ntrue for our synthetic data. While for healthy roots this\nis also well fulfilled, the radius of drying roots will\nunavoidably be systematically underestimated by this\nmethod.\n"],"Page":6,"Number":4,"Type":"Figure","CaptionBB":[99,446,724,501],"Height":1169,"Width":827,"DPI":100,"ImageBB":[143,130,653,439]}