{"Caption":"Figure 1. Portions of two participants’ calendars.","ImageText":[],"Mention":["Kayla and Larry are married with a nine-year old son, Ian \n(names have been changed). Kayla works around 25 hours a \nweek as a teacher and also volunteers with the school drama \nprogram. Larry works over 40 hours per week as a finance \ndirector. At the heart of the family’s coordination routine is \nthe school district calendar (Figure 1, left), which is \nnormally kept on the wall next to the kitchen phone. \nSometimes the calendar leaves this location, but only if \nKayla is doing detailed planning. Kayla used to have a daily \nplanner in her purse, but found it was difficult to manually \nsynchronize events between it and the wall calendar. \n","Flexibility. Family calendars contain a wide range of events \nfrom birthdays and anniversaries to doctor’s appointments, \ndays off from school, and recurring sports games (see \nFigure 1 for many examples). Some people choose not to \ninclude the routine activities that occur frequently, e.g., \nchurch on Sunday, the soccer practice that is the same time \nand place each week. On the other hand, some add these \nevents to the calendar for fear they may schedule something \nthat conflicts with a routine event. For each event, \nparticipants typically write its start and end times, and \nlocation. Some participants add the name or initials of who \nthe event was for, and sometimes times\/locations are \ndropped for events because family members simply ‘know’ \nthese details. Events sometimes come in through email (e.g., \na child’s list of baseball games), requiring people to \nmanually copy them to the calendar.  \n","Flexibility. We specifically added features into LINC to \nallow flexibility of routines. These include the ability for \nusers to drag items into a ‘Need to Schedule’ box (Figure 1, \n","right) that acts just like a bulletin board or ‘To Do’ list, or \nadd images to the ‘Photos’ box (Figure 1, right) which can \nthen be dragged on to any date or event for personalization. \nWe did not include any special integration with other digital \norganizational systems as our focus at this point was on the \nuser interface of family calendar; this is an area planned for \nfuture explorations.  \n"],"Page":3,"Number":1,"Type":"Figure","CaptionBB":[279,979,572,993],"Height":1100,"Width":850,"DPI":100,"ImageBB":[112,704,741,980]}