{"Caption":"Figure 2: Vertex location optimisation for a sphere: (a) mesh before optimisation; (b) mesh after optimisation; (c) and (d) corresponding error rendering for (a) and (b). Colour indicates error, with blue, green, yellow, orange and finally red indicating increasing errors. ","ImageText":[{"Text":"(d)","TextBB":[639.601,375.965,654.357,384.518],"Rotation":0},{"Text":"(c)","TextBB":[506.417,375.965,519.981,384.518],"Rotation":0},{"Text":"(b)","TextBB":[639.601,214.435,654.357,222.987],"Rotation":0},{"Text":"(a)","TextBB":[506.118,214.435,520.278,222.987],"Rotation":0}],"Mention":["where dA(p) is a surface area element at point p. All\nthe models are rescaled to fit to a unit cube and the in-\nput surfaces are treated as PN curved meshes. Detailed\nstatistics of various examples are given in Table 1. Our\nmethod is applicable to a variety of input triangle meshes.\nMeshes used for our testing were produced using isotropic\nremeshing [20] (Figs. 2-4), feature sensitive remeshing [20]\n(Fig. 5), centroidal Voronoi diagram based remeshing [22]\n(Fig. 7) and geometry images [16] (Fig. 8). A fixed set of\nparameters as described above was used in all experiments.\nThe first example is a discrete sphere with about 1000\nvertices. As shown in Fig. 2, the shape is only slightly\nchanged with almost the same regularity, but the approx-\nimation error is significantly reduced, maximum error by\nmore than 40% and average error reduced by about 75%.\nWe use the same colour coding scheme throughout the pa-\nper, with blue, green, yellow, orange and finally red indi-\ncating increasing errors. The same scale is used to ren-\nder both input and optimised meshes. Since a sphere is\nuniformly non-planar everywhere, a significant reduction\nof approximation error is observed. Another example is\nshown in Fig. 3 that optimises an isotropic remeshing with\n","Example\nSphere (Fig. 2)\nArmadillo (Fig. 3)\nDavid (Fig. 4)\nFandisk (Fig. 7)\nDragon (Fig. 8)\n"],"Page":4,"Number":2,"Type":"Figure","CaptionBB":[418,405,744,470],"Height":1169,"Width":827,"DPI":100,"ImageBB":[448,75,716,387]}