{"Caption":"Figure 2. CT image reconstruction: (a) The original phantom; (b) Average of the 5 FBP results; (c) 7x7 sobel edge detection with threshold 35; (d) MAP restoration using edge detection result in (c); (e) The MI penalty term during the 1st iteration; (f) Regularized Bayesian framework provides the result with minimum error. ","ImageText":[],"Mention":["We also test our algorithm in an interesting extension\nfor Computed Tomography (CT). Filtered back-projection\n(FBP) is widely used in most commercial CT machines\nfor its ef\u0002ciency but suffers streaking artifacts [6]. Image\nrestoration techniques can signi\u0002cantly improve the FBP's\nquality. We test our algorithm on the `Herman head' phan-\ntom generated by CTSim software (http:\/\/www.ctsim.org\/)\nas shown in Fig. 2 (a). We generate projections of the phan-\ntom and corrupt them with zero mean white Gaussian noise\n(variance is 1). Five different images are obtained by FBP\n(iradon function in Matlab). All the images have the same\nstructure but the noise are independent. The back-projection\nproduces streaking type of noise, which is very dif\u0002cult to\nbe distinguished from true edges in the image.\n","The average of the \u0002ve images is shown in Fig. 2 (b). The\nmulti-image restoration technique is applied to improve the\nimage quality. Both traditional Bayesian method and our\nnew algorithm signi\u0002cantly improve the quality. However,\nthe traditional Bayesian method needs much more speci\u0002c\ntuning. Simple edge modeling in Eq. 18 cannot handle the\nstrong streaking noise. To obtain a good result, we have\nto tune the edge detector manually. From original phan-\ntom image, we know where are the structures and try the\nsobel edge detector with different size and different thresh-\nold to detect them in the average image. The 7x7 sobel \u0002l-\nter with threshold 35 detects the structures reasonably well\nwith least false detection (Fig. 2 (c)). The restoration result\nshown in Fig. 2 (d) preserves most structures but has some\nsigni\u0002cant streaking noise due to the false edge detection.\n","The regularized Bayesian method requires no speci\u0002c\ntuning. Initialized with the low-pass \u0002ltered average im-\nage, the MI term successfully detects the restoration errors\n(i.e. the blurred structures) with no false detection as shown\nin Fig. 2 (e). The MI term is estimated within a neighbor-\nhood and hence more blurred than the sobel edge detector\nin Fig. 2 (c). But it does not affect the sharpness of the re-\nstored structures because the MI term will be reduced only\nwhen the restoration error within the neighborhood is mini-\nmized. In the \u0002nal result in Fig. 2 (f), all the streaking noise\nis removed while the structures are well preserved.\n"],"Page":8,"Number":2,"Type":"Figure","CaptionBB":[84,473,740,525],"Height":1169,"Width":826,"DPI":100,"ImageBB":[157,100,669,459]}