{"Caption":"Figure 5. Denoising capability of the ROF model for the Liver data set using λ = 0.01. ","ImageText":[{"Text":"(a)","TextBB":[100.14,385.311,112.428,395.208],"Rotation":0},{"Text":"Original","TextBB":[116.988,385.311,153.883,395.208],"Rotation":0},{"Text":"image","TextBB":[156.651,385.311,183.705,395.208],"Rotation":0},{"Text":"(b)","TextBB":[280.849,385.311,293.756,395.208],"Rotation":0},{"Text":"Denoised","TextBB":[298.316,385.311,340.126,395.208],"Rotation":0},{"Text":"image","TextBB":[342.894,385.311,369.948,395.208],"Rotation":0}],"Mention":["We used the following parameters for the ROF-primal al-\ngorithm. In case of the Brain data set we used ε = 1e− 04.\nIn case of theLiver data set we used ε = 1e − 05 since the\nresolution of the intensity values is about 10 times higher.\nFor the ROF-dual algorithm we did not have to set any ad-\nditional algorithms. ROF-max-flow was computed using a\n6-connected graph and 8-bit accuracy.\nTab. 4 shows the results of the ROF model applied to\nthe Brain data set and the Liver data set for different values\nof λ. Unfortunately, ROF-max-flow cannot be executed for\nthe Liver data set, due to a heavy memory requirement. We\neven tried it on a 64-bit machine equipped with 16GB of\nmain memory, but the algorithm failed. On the other hand,\nusing ROF-dual, the solution was obtained after approxi-\nmately 20 seconds. This enables our method to be applica-\nble for clinical practice even for large data sets. Fig. 5 gives\nan example of the denoising capability of the ROF model\napplied to the Liver data set.\nOne can see that ROF-dual has always a superior perfor-\nmance compared to ROF-primal and ROF-max-flow. One\ncan also see that the relative performance of the variational\nmethods of the graph based method decrease in case of\nlarger values of λ. This also reflects the results we obtained\nfrom our 2D experiments. In contrast to the 2D experiments\nthe relative performance of ROF-primal compared to ROF-\ndual is considerably better. In case of the primal formula-\ntion of the ROF model, the size of the optimization problem\nis exactly the size of the input image. In case of the dual\n"],"Page":7,"Number":5,"Type":"Figure","CaptionBB":[68,408,398,436],"Height":1100,"Width":850,"DPI":100,"ImageBB":[67,236,400,397]}