{"Caption":"Figure 9. Image set of the mockup of the Hubble Space Telescope latch. The original image size is 300x920 pixels. ","ImageText":[],"Mention":["lying edge structure should be straight and nearly vertical\nin this region, but some edges are seriously distorted by the\nshadows (see the same location in the corresponding edge\nmap). This distortion is rectiﬁed in the edge map generated\nby the multi-channel algorithm (Figure 7(c)). The multi-\nchannel algorithm also removed the shadow edges over the\narea a little below the top-right corner of the image “7-3-3”\n(Figure 7(b)).\nBased also on the grappling ﬁxture image set, Figure 8\nprovides a comparison between the logical combinations\nof the individual edge maps computed by the Canny edge\ndetector and the edge map computed by the multi-channel\nalgorithm directly. The left three images are the com-\nbined edge maps obtained by merging all of the individ-\nual edge maps using simple logical operations (AND, OR\nand majority-voting). The logical AND and OR operations\nare very vulnerable to illumination changes. There is al-\nmost no edge structure in the combined edge map using the\nAND operation, while the results of using the OR opera-\ntion are extremely fuzzy. The majority-voting scheme [9]\nis more robust and works better than either the AND or\nthe OR operation, but its mechanism of distinguishing out-\nliers is succeptable to failure. Many edges are disconnected\n(especially the long edges) and even disappear in the com-\nbined edge map. These problems do not exist in the edge\nmap computed by the multi-channel algorithm (the right-\nmost image).\nIf all space targets were pre-positioned, then special pur-\npose target tracking software could be developed to track\nexactly those targets. (And the targets themselves would be\nspecially designed in order to simplify the task.) Indeed this\nis the case for the docking latch target, which was speciﬁ-\ncally designed to permit algorithms to compute the relative\npose of the target. Unfortunately not all targets fall into\nthis category. Figure 9 shows a set of 20 multiple-exposure\nimages of a mockup of a latch from the Hubble Space Tele-\n"],"Page":7,"Number":9,"Type":"Figure","CaptionBB":[100,700,410,727],"Height":1100,"Width":850,"DPI":100,"ImageBB":[117,318,396,682]}