{"Caption":"Figure 4: Binary classification example. a) and e) Mesh models of normal and abnormal heads, respectively. b) and f) Output of the first classification module. Components 1-4 are associated with healthy individuals while components 5-8, with unhealthy ones. Labeled points outside the bounded regions correspond to false positives. c) and g) Output of the second classification module. d) and h) Normalized classifier margin of the components associated with the second classification module. Red points represent high confidence values while blue points represent low values. ","ImageText":[{"Text":"P","TextBB":[226.056,322.243,231.488,331.037],"Rotation":0},{"Text":"3","TextBB":[301.779,326.327,306.306,333.859],"Rotation":0},{"Text":"1","TextBB":[307.479,321.443,312.006,328.974],"Rotation":0},{"Text":"2","TextBB":[312.364,331.214,316.891,338.745],"Rotation":0},{"Text":"1","TextBB":[613.631,333.071,618.61,341.355],"Rotation":0},{"Text":"4","TextBB":[336.791,353.198,341.318,360.729],"Rotation":0},{"Text":"a)","TextBB":[230.127,365.139,237.086,373.2],"Rotation":0},{"Text":"b)","TextBB":[301.78,365.139,309.241,373.2],"Rotation":0},{"Text":"c)","TextBB":[375.875,365.139,382.834,373.2],"Rotation":0},{"Text":"+1","TextBB":[403.558,358.542,414.697,367.58],"Rotation":0},{"Text":"0","TextBB":[612.817,386.811,617.797,395.096],"Rotation":0},{"Text":"Q","TextBB":[227.683,411.808,234.738,420.602],"Rotation":0},{"Text":"Normalized","TextBB":[602.232,399.596,648.36,408.39],"Rotation":0},{"Text":"Margin","TextBB":[611.188,410.18,639.953,418.974],"Rotation":0},{"Text":"5","TextBB":[309.922,414.036,313.997,420.814],"Rotation":0},{"Text":"7","TextBB":[304.222,419.735,308.296,426.513],"Rotation":0},{"Text":"6","TextBB":[312.364,422.992,316.438,429.77],"Rotation":0},{"Text":"d)","TextBB":[465.44,427.022,472.901,435.082],"Rotation":0},{"Text":"8","TextBB":[335.163,441.134,339.69,448.666],"Rotation":0},{"Text":"e)","TextBB":[229.312,461.219,236.272,469.28],"Rotation":0},{"Text":"f)","TextBB":[298.523,461.219,304.488,469.28],"Rotation":0},{"Text":"h)","TextBB":[556.634,426.207,564.095,434.268],"Rotation":0},{"Text":"−1","TextBB":[402.744,446.479,413.883,455.517],"Rotation":0},{"Text":"g)","TextBB":[375.875,461.219,383.336,469.28],"Rotation":0}],"Mention":["An architecture capable of discriminating two shape classes consists of a cascade of two\nclassification modules. The first module identifies the components of each shape class,\nwhile the second verifies the geometric consistency (spatial relationships) of the compo-\nnents. Figure 4 illustrates the classification procedure on two sample surface meshes from\na test set of 200 human heads. The first mesh (Figure 4 a) belongs to the class of healthy in-\ndividuals, while the second (Figure 4 e) belongs to the class of individuals with a congenital\nsyndrome that produces a pathological craniofacial deformation. The input classification\nmodule was trained with a set of 400 surface meshes and 4 critical points per class to rec-\nognize the eight components shown in Figure 4 b and f. The first four components are\nassociated with healthy heads and the rest with the malformed ones. Each of the test sur-\nface meshes was individually processed as follows. Given an input surface mesh to the\nfirst classification module, the classifier ensemble (component detectors and components\nclassifier) is applied to the numeric surface signatures of its points (Figure 4 a and e). A\nconnected components algorithm is then applied to the result and components of size below\na threshold (10 mesh points) are discarded. After this process the resulting labeled mesh is\nfed to the second classification module that was trained with 400 labeled meshes and two\n","critical points to recognize two new components. The first component was grown around\nthe point P in Figure 4 a. The second component was grown around point Q in Figure 4 e.\nThe symbolic signatures inside the region around P encode the geometric configuration of\nthree of the four components learned by the first module (healthy heads), while the sym-\nbolic signatures around Q encode the geometric configuration of three of the remaining\nfour components (malformed heads), Figure 4 b and f . Consequently, the points of the\noutput mesh of the second module will be set to “+1” if they belong to learned symbolic\nsignatures associated with the healthy heads (Figure 4 c) , and “-1” otherwise (Figure 4 g).\nFinally, the filtering algorithms described above are applied to the output mesh. Figure 4 c\n(g) shows the region found by our algorithm that corresponds to the shape class model of\nnormal (respectively abnormal) head.\n"],"Page":6,"Number":4,"Type":"Figure","CaptionBB":[173,473,680,556],"Height":1100,"Width":850,"DPI":100,"ImageBB":[200,284,650,471]}