{"Caption":"Figure 4. Acquired maps from oiled human palm skin (massage oil). (a) photo, (b) diffuse map, (c) specular map, (d) confidence map (green: high confidence, red: low confidence), (e) normal map, (f) depth map and (g,h) renderings. ","ImageText":[{"Text":"(a)","TextBB":[446.987,356.289,459.277,366.417],"Rotation":0},{"Text":"Photo.","TextBB":[463.853,356.289,492.457,366.417],"Rotation":0},{"Text":"(b)","TextBB":[525.35,356.289,538.257,366.417],"Rotation":0},{"Text":"Diffuse.","TextBB":[542.821,356.289,578.508,366.417],"Rotation":0},{"Text":"(c)","TextBB":[605.275,356.289,617.56,366.417],"Rotation":0},{"Text":"Specular.","TextBB":[622.124,356.289,663.002,366.417],"Rotation":0},{"Text":"(d)","TextBB":[681.025,356.289,693.932,366.417],"Rotation":0},{"Text":"Confidence.","TextBB":[698.496,356.289,751.69,366.417],"Rotation":0},{"Text":"(e)","TextBB":[443,458.239,455.287,468.367],"Rotation":0},{"Text":"Normal.","TextBB":[459.851,458.239,496.432,468.367],"Rotation":0},{"Text":"(f)","TextBB":[529.212,458.239,540.271,468.367],"Rotation":0},{"Text":"Depth.","TextBB":[544.835,458.239,574.656,468.367],"Rotation":0},{"Text":"(g)","TextBB":[625.412,458.239,638.324,468.367],"Rotation":0},{"Text":"(h)","TextBB":[707.612,458.239,720.524,468.367],"Rotation":0}],"Mention":["Even with normalization, specularity detection can be\nvery sensitive to the chosen threshold, in particular for high\nalbedo materials such as human skin (Fig. 4). We therefore\nwish to isolate the specular component in the input images\nusing polarization [22]. The polarization state of light is ap-\nproximately preserved under specular reflection, and “ran-\ndomized” scattered after diffuse reflection [6]. Thus, under\npolarized illumination, we can get a diffuse-only image by\nplacing a linear polarizing filter in front of the lens, oriented\northogonally to the polarization direction. Rotating the filter\nby 90 degrees yields an image that contains both the specu-\nlar and diffuse component. Specularity isolation is achieved\nsimply by subtracting the two images. Note that because we\nare using an LCD monitor, we get polarized illumination\n“for free”. This more robust detection method comes at the\ncost of doubling the required number of images.\n","Our results were generated with a regular 1280 × 1024\nLCD screen, a digital SLR camera (Canon EOS 400D with\ndefault EF-S 18-55mm, f\/3.5-5.6 kit lens) and a linear polar-\nizing filter. The camera, screen and mesostructure are cali-\nbrated with respect to each other. The screen and camera are\nfacing a similar direction and hence are calibrated using a\n(spherical) mirror to make the screen visible to the camera,\nsimilar to the method of Francken et al. [7]. The mesostruc-\nture is attached to a supporting surface with position and\norientation determined using a calibration pattern [3].\nAssuming the surface is in perfect focus, and depending\non the mesostructure’s placement, we have a spatial resolu-\ntion of approximately 40 normal pixels per millimeter. The\nlargest number of patterns we used in our setup is 15 (one\nfloodlit, 7 horizontal, 7 vertical). The angular resolution\nthen is approximately 1.12 normals per degree. The recov-\nerable normal angles range from -22.5 to 22.5 degrees w.r.t.\nthe supporting surface’s normal. Using a larger screen, or\nmultiple screens, can improve this range. Even though the\nnormal range seems limited, it suffices for the mesostruc-\ntures we scanned. We always obtained a visually plausible\nreconstruction. Moreover, reflected light from grazing an-\ngles is often blocked anyway due to self-occlusions.\nFig. 4 shows the different maps that we obtain from an\nacquired surface. In the first place, our method returns a\nnormal map (with confidence), which can be turned into a\ndepth map [8]. As a byproduct of the polarization-based\nseparation discussed in Sec. 3.4, we also infer a diffuse and\nspecular map, which were computed from the floodlit illu-\nmination pattern. These maps can easily be used as textures\n"],"Page":3,"Number":4,"Type":"Figure","CaptionBB":[427,474,757,533],"Height":1100,"Width":850,"DPI":100,"ImageBB":[428,266,759,470]}