{"Caption":"Figure 2: A 3-dimensional representation of the 2-dimensional current basis functions. The dashed grid shows the grid for the piecewise constant charge basis functions. The current density is plotted in the vertical direction and is shown by the shaded surface. ","ImageText":[{"Text":"(a)","TextBB":[146.497,429.062,161.519,440.131],"Rotation":0},{"Text":"The","TextBB":[165.518,429.062,185.764,440.131],"Rotation":0},{"Text":"piecewise","TextBB":[189.763,429.062,236.853,440.131],"Rotation":0},{"Text":"constant","TextBB":[241.019,429.062,284.511,440.131],"Rotation":0},{"Text":"current","TextBB":[288.676,429.062,325.593,440.131],"Rotation":0},{"Text":"basis","TextBB":[329.592,429.062,354.543,440.131],"Rotation":0},{"Text":"function.","TextBB":[358.542,429.062,403.938,440.131],"Rotation":0},{"Text":"(b)","TextBB":[452.664,429.062,468.338,440.131],"Rotation":0},{"Text":"Piecewise","TextBB":[472.505,429.062,521.067,440.131],"Rotation":0},{"Text":"linear","TextBB":[525.067,429.062,553.814,440.131],"Rotation":0},{"Text":"current","TextBB":[557.647,429.062,594.563,440.131],"Rotation":0},{"Text":"basis","TextBB":[598.563,429.062,623.513,440.131],"Rotation":0},{"Text":"function.","TextBB":[627.346,429.062,672.743,440.131],"Rotation":0}],"Mention":["A common choice of basis functions for the PEEC method consists of piecewise constant basis\nfunctions (block-functions) for both the currents and the charges. For example, a thin transmission\nline would be divided into segments as shown in Figure 1. On each segment a constant current\nbasis function is defined. For the charge basis functions, the transmission line is again divided into\nsegments, but shifted with respect to the current cells, such that the centers of the new chrage\nsegments correspond to the boundaries of the current cells. On the conductor surface of the charge\nsegments, constant surface charge basis functions are defined. At the end of the transmission line,\nthere are two half-sized charge cells. This basis does satisfy orthogonality conditions (3.21) and\n(3.23), but only approximately satisfies (3.16). Still, formulation (3.22) is used.\nThe basis described for the trasmission line is essentially 1-dimensional, but it can easily be\nextended to 2 dimensions (see Figure 2(a)) or a 3-dimensional basis. Often, rectangular cells are\nused, but this can be generalised to linear deformations of rectangles [11].\n","For a more accurate discretisation, we could use a more sophisticated basis. The basis described\nin this section also has piecewise constant charge basis functions (block-functions), but it has\npiecewise linear current basis functions (tent-functions). They can be combined in such a way\nthat relation (3.16) is satisfied exactly. A 2-dimensional example of a tent-shaped current basis\nfunction is shown in Figure 2(b)).\nIt is not necessary to work with rectangular cells. Suppose the conductors are subdivided\nin arbitrary triangles (2D) or tetrahedrons (3D). On each cell we define a constant charge basis\nfunction and for each cell boundary we define a current basis function with piecewise constant\ndivergence. The current basis function has its support on the two connecting cells, and per unit\ntime it takes a unit charge from the one cell to the other. This idea can be extended to cell types\n"],"Page":8,"Number":2,"Type":"Figure","CaptionBB":[143,455,694,500],"Height":1100,"Width":850,"DPI":100,"ImageBB":[130,318,705,442]}