{"Caption":"Figure 4. The results of the visual distortion experiment for force levels 1, 3,   and 5. The mean produced force is plotted as a function of the percentage     distortion for both feedback conditions. Open circles represent young    subjects, and asterisks represent elderly subjects. Error bars indicate the   standard error. The average regression lines for each force level\/feedback                 condition are also shown for each subject group. ","ImageText":[],"Mention":["testing to minimize the false discovery rate [19].  Linear \nregression was also performed for produced force as a \nfunction of percentage distortion for each subject for each \nforce level\/feedback condition.     \nLinear trends significant at the 5% level were seen for all \nforce levels for elderly subjects in the with-feedback condition \n(Figure 4).  For force level 5, distortion increased the produced \nforce by 72.5% for the with-feedback trials.  In addition, linear \ntrend analysis revealed the slope of the average regression line \nto be linearly related to the force level for elderly subjects in \nthe with-feedback condition (p < 0.001).  When a t-test was \nused to compare the average slope of produced force with \npercent distortion for force level 5 to the corresponding data \ntaken with young subjects [5], no significant difference was \nfound (p = 0.707).   \nSignificant linear trends were seen only for force levels 1, \n2, and 5 in the no-feedback condition for elderly subjects.  The \nslope of the mean regression line was not linearly related to \nthe force level (p = 0.156).  For young subjects, on the other \nhand, significant linear trends were seen in force levels 3-5 in \nthe no-feedback condition.  For force level 5, the difference \nbetween young and elderly subjects in the slope of produced \nforce with distortion was close to significant in the no-\nfeedback condition (p = 0.0557). \nThe forces produced by SKL for force level 5 are plotted \nas a function of distortion in Figure 5.  Her mean force rose \nlinearly in the with-feedback condition for force level 5, but \nnot in the no-feedback condition.  This result was typical of \nSKL’s performance at other force levels.  Visual distortion of \n92.0% increased her produced force for force level 5 by 97.7% \nin the with-feedback condition. \n When asked whether the forces represented on the bar \nchanged during the experiment, four elderly subjects answered \nin the affirmative.  However, only one of those subjects \ncorrectly identified the direction of the distortion.  The other \nthree claimed that the distortion went in both directions, that \nthe force required to reach the bottom (high-force end) of the \nbar was sometimes greater and sometimes less.  We \ndetermined that those subjects had not actually detected the \ndistortion.  Most subjects stated that they were consistent in \nthe force that they produced for each level.  Subject SKL did \n"],"Page":4,"Number":4,"Type":"Figure","CaptionBB":[76,310,411,385],"Height":1100,"Width":850,"DPI":100,"ImageBB":[119,77,387,302]}