{"Caption":"Figure 1: Photo of a bike taken with an iPhone 3G and a corresponding Google Street View image based on the stored geo- coordinates. The accuracy of the camera location (marked) in front of the garage is about +\/−1 m. Many classified advertisements come with photos of objects offered for sale, with geo-tags automatically added. ","ImageText":[],"Mention":["it for sale (see Figure 1). When we then entered the geo-\ncoordinates that the phone embedded into the picture into\nStreet View, Google was able to locate the photo’s posi-\ntion within+\/−1m. Such accuracy is much higher than\nwhat we believe most people would expect.\nAmong the Craigslist postings with geo-information\nwe also found a significant number where the poster\nchose to not specify a home address, phone number,\nor e-mail account and opted for Craigslist’s anonymous\nemailing option. We take this as an indication that many\nposters were not aware that their images were geo-tagged\nand thus leaked their location information.\nWe note that while we only performed experiments\nwith Craigslist’s “For Sale” category, it is not hard\nto imagine what consequences unintended geo-tagging\nmight have in “Personals” or “Adult Services”.\nTwitter. Blogging has become a common tool for\ncelebrities to provide their fans with updates on their\nlives, and most of such blogs contain images. Likewise,\nmany celebrities now also use public Twitter feeds that,\nbesides potentially being geo-tagged themselves, may\nalso link to external images they took. Our second sce-\nnario therefore involved tracking a popular reality-TV\nhost who is very active on Twitter. His show is broad-\ncast on US national television and has been exported into\nvarious foreign countries. In recent episodes, the chan-\nnel even began advertising that the host is maintaining a\nTwitter feed. It turns out that most images posted to that\nfeed—including photos taken at the host’s studio, places\nwhere he walks his dog, and of his home—were taken\nwith an iPhone 3GS and are hosted on TwitPic, which\nconserves EXIF data. In addition, we noticed that the\nhost is also commonly tweeting while he is traveling or\nmeeting other well-known people away from home. Us-\ning the Firefox plug-in Exif Viewer, a right-click on any\nof the Twitter images suffices to reveal these locations\nusing an Internet map service of one’s choice. Again, av-\neraging geo-tags from multiple images taken at the same\nlocation would increase accuracy further.\nGeo-location can also be exploited for taking the op-\nposite route: finding a celebrity’s non-advertised Twit-\nter feed intended only for private purposes (e.g., for ex-\nchanging messages with their personal friends2). Doing\nso becomes possible with sites such as Picfog, which al-\nlows anybody to search all images appearing on Twit-\nter by keyword and geo-location in real-time. Hav-\ning a rough idea of where a person lives thus allows a\nuser to tailor queries accordingly until the right photo\nshows up. As an experiment, we succeeded in finding a\nnon-advertised but publicly-accessible Twitter-feed of a\ncelebrity with a residence in Beverly Hills, CA.\nYouTube. In our final setup, we examined whether\none can semi-automatically identify the home addresses\nof people who normally live in a certain area but are cur-\nrently on vacation. Such knowledge offers opportunities\n"],"Type":"Figure","Number":1,"Page":5,"CaptionBB":[98,310,750,354],"Height":1100,"Width":850,"DPI":100,"ImageBB":[115,98,735,295]}