{"Caption":"Figure 6: Program used to administer the quantita- tive experiment running the (a) Summary Thumb- nail, (b) Desktop, and (c) Single-Column interface. ","ImageText":[{"Text":"a","TextBB":[760.167,752.747,767.848,768.165],"Rotation":0},{"Text":"b","TextBB":[589.833,923.164,597.515,938.582],"Rotation":0},{"Text":"c","TextBB":[760.5,923.164,767.407,938.582],"Rotation":0}],"Mention":["All interfaces were presented on an 18” LCD screen run-\nning at 1280x1024 pixel resolution. As shown in Figure 6, \nthe top area of the 818x827 pixel study environment con-\ntained a textual description of the task, while the remaining \ndisplay area was used to display the respective interface. \nFor the thumbnail-based interfaces and the Single-Column \ninterface, the window contained a simulated PocketPC de-\nvice with a display area of 240x320 pixels. Since we in-\ncluded the Desktop condition as an approximate upper \nbound on performance on these tasks, we did not intention-\nally limit the browsing space used by these interfaces. In \nfact, our Desktop offered a viewing space of 800x600 pix-\nels (Figure 6b).  \n","Each trial started with a written task description displayed \nat the top of the study environment (Figure 6). When ready, \nthe participant clicked a button to reveal the web page de-\nscribed and to start the timer. The participant’s task was to \nlocate the information described in the textual description \nand place a marker on that location. Markers were placed \nby clicking into that area or by dragging an existing marker \nwith the mouse. Size and shape of the area considered a \ncorrect answer varied across pages, but all were large \nenough to allow easy placement of the marker. When satis-\nfied, the participant pressed a button to complete the trial. \n","Example: The page in Figure 6 shows an imdb.com review \nfor the movie Shrek 2. The task description at the top of the \nwindow reads “You are thinking about renting a movie for \nthe night, and remember your friend once recommended \n\"Shrek 2\". You want to see what the rating is before head-\ning to the video store. You have used this movie re-\nview\/database site in the past, so you went to the home \npage, searched for \"Shrek 2\" by name, and navigated to \nthe following page. You expect to see the rating informa-\ntion somewhere in the main section of the page, and you \nknow they will be next to those bright yellow stars. <Click \n\"Ready To Start\" to look for the rating of the movie \"Shrek \n2\">.  \n","Next, we manually aggregated the gathered information \ninto task descriptions, each consisting of a web page and a \nbrief task and background description. Figure 6 shows one \nexample. \n"],"Page":6,"Number":6,"Type":"Figure","CaptionBB":[459,948,749,993],"Height":1100,"Width":850,"DPI":100,"ImageBB":[439,432,777,942]}