{"Caption":"Figure 3: Example of parameter settings. Fig. 3(a) shows the sampled feature points on the source side and the selected source point (in red for which the belief is shown on the target side on the subsequent images. The brighter the spots the better the source point matches the corresponding target points. Fig. 3(b) shows a probability distribution without any smoothness term (λ = 0). Figs. 3(c) and 3(c) show paramater settings (λ = 1, ρ = 0.2, respectively λ = 5, ρ = 0.1) for more localized symmetry patterns. At the other end of scale, Fig. 3(e) shows a marginal distribution which has exactly one peak (λ = 5, ρ = 0.05). ","ImageText":[{"Text":"(a)","TextBB":[150.515,235.484,162.803,245.38],"Rotation":0},{"Text":"(b)","TextBB":[277.41,235.484,290.317,245.38],"Rotation":0},{"Text":"(c)","TextBB":[404.924,235.484,417.211,245.38],"Rotation":0},{"Text":"(d)","TextBB":[531.818,235.484,544.725,245.38],"Rotation":0},{"Text":"(e)","TextBB":[659.332,235.484,671.619,245.38],"Rotation":0}],"Mention":["λ controls the smoothness of the distribution in the assign-\nment space. The higher the value the more influential be-\ncomes the pairwise potential enforcing geometrical consis-\ntency. For partial symmetry detection it is important to al-\nlow for multiple peaks in the marginals while ensuring geo-\nmetrical consistency. This is controlled by the parameter ρ\nwhich enables to have different probability values for neigh-\nboring source points (i.e. allow for discontinuities). It takes\nvalues between [0.1..1.0]. In our experiments we set ρ to\n0.4. The parameter is called in the literature as the trun-\ncation parameter in the negative log likelihood space [23].\nAlso the level of discretization on the target side has to be\nlinked with λ since it defines the allowed variance from the\nisometric mapping. Now, by varying λ and ρ we can extract\nsymmetries at different levels of resolution. For instance,\nglobal symmetries can be detected at a coarser resolution\nand in this case λ can be set high. Fine symmetries can be\ndetected at a high resolution and in this case λ should be\nsmaller. See Fig. 3 for examples of parameter settings.\n"],"Page":4,"Number":3,"Type":"Figure","CaptionBB":[68,265,758,339],"Height":1100,"Width":850,"DPI":100,"ImageBB":[95,99,732,246]}