{"Caption":"Figure 7: Result on the two-population (CEPH and YRI) HapMap data. (a) The estimated population map of the whole dateset with two populations. (b) The estimated recombination rates along the chromosomal position in the two populations. ","ImageText":[{"Text":"a","TextBB":[175.243,182.797,182.162,195.084],"Rotation":0},{"Text":".","TextBB":[182.161,261.537,186.008,273.825],"Rotation":0},{"Text":"CEPH","TextBB":[374.069,296.537,404.164,307.37],"Rotation":0},{"Text":"YRI","TextBB":[624.476,296.537,642.535,307.37],"Rotation":0},{"Text":"b","TextBB":[174.858,359.305,182.552,371.593],"Rotation":0}],"Mention":["in Figure 7a, the left half of the map clearly represents the CEPH population and the\nright half the YRI population. We found that the two dominant haplotypes covered\nover 85% of the CEPH population (and the overall breakup among all four ancestors\nis 0.5618, 0.3036, 0.0827, 0.0518). On the other hand, the frequencies of each ancestor\nin YRI population are 0.2141, 0.1784, 0.3209, 0.1622, 0.1215 and 0.0029, showing that\nthe YRI population is much more diverse than CEPH. This might explain an earlier\nobservation that genetic inference on the YRI population appeared to be more difficult\nthan for CEPH (Marchini et al. 2006). The recombination maps of the two different\npopulations also show noticeably different spatial patterns of recombination hotspots\n(Figure 7b), which may reflect different recombination histories of the founders of the\ntwo populations.\n","Note that the population partition result reported in Figure 7b is trivial because it\nis inferred purely based on SNPs haplotypes without knowledge of ethnic labels of the\nsamples. In most genetic samples, ethnic labels are either not available or ambiguous\n(e.g., the Daly data has no subpopulation details). By discovering the right popula-\ntion separation, one can perform hotspot estimation for each population and capture\npopulation-specific LD (as in Figure 7a); whereas in a mixed population, one may not\nbe able to correctly estimate such patterns.\n"],"Page":23,"Number":7,"Type":"Figure","CaptionBB":[161,475,688,513],"Height":1100,"Width":850,"DPI":100,"ImageBB":[173,167,656,449]}