{"Caption":"Figure 9: Depth-ordered planes for a set of indoor images. Planes with thicker lines are in front.","ImageText":[],"Mention":["We implement our algorithm in MATLAB. The same set\nof parameters are used for all the results shown in Fig. 9\nand Fig. 10. The most time consuming operation is edge\ndetection, for which we use the MATLAB Canny edge de-\ntector (about 5 seconds for an image of size 400 × 400 on\na linux machine with 2GHz CPU). The rest grouping oper-\nations deal with significantly fewer and larger geometrical\nentities, which altogether can be done in less than 0.5 sec-\nonds. There is no learning or indexing involved.\n","1. Grouping lines into quadrilaterals. Our current\nalgorithm hypothesizes a quadrilateral area with two adja-\ncent lines of different directions. This simple recipe is local\nand thus prone to false positives. The middle blue plane in\nFig. 1a is such a case. A red vertical line is taken from the\nwindow curtain, while a green line is taken from the edge\nof the bed. This plane does not exist in the 3D space. Such\nover-generalizations can also be seen in Fig. 9 (row 2, col-\numn 1). Shading, texture, and cross validation from nearby\nplanes could help eliminate these false plane hypotheses.\n","2. Sensitivity of relative depth cues. Our relative depth\ntest is remarkably accurate at small depth differences. In\nFig. 9 (row 1, column 2): the front side of the night stand\nis correctly evaluated to be in front of the left wall, not be-\ncause there are green lines between the legs of the stand,\nbut because both vertical lines corresponding to the two legs\nare detected and the spatial relationship between their end-\npoints provides a powerful cue for perspectivity. On the\nother hand, this sensitivity also makes a wall fixture such as\nthe heater in Fig. 9 (row 1, column 3) to be in front, which\n","is straightforward: lines forming quadrilaterals that do not\nlie farthest back are occluders. However, this leaves some\nunpaired lines unaccounted for, even if they are contained in\nsome quadrilateral. Many results in Fig. 10 can be improved\nif line-plane grouping is jointly considered.\n4. Constraints on depth and extent provided by\nplanes of different orientations. Our depth-ordering of\nquadrilaterals only concerns the quadrilaterals that point in\nthe same direction. In Fig. 9 (row 2, column 3), there are no\nupright blue quadrilaterals detected at the far end, making\nthe depth 1 plane, which delineates the spatial frame, far\nfront than it should be. If we take adjacent red and green\nplanes into account, it is obvious that a blue plane must ex-\nist farther in the back. Therefore, how planes of different\norientations line up in depth need to be considered jointly\nin order to derive the spatial frame of a room. For example,\ndetermining the extent of the floor relies on the constraints\nprovided by the clutters sitting upright on the floor.\n"],"Page":5,"Number":9,"Type":"Figure","CaptionBB":[177,991,666,1006],"Height":1169,"Width":826,"DPI":100,"ImageBB":[105,79,744,975]}