{"Caption":"Figure 3: A simple fac¸ade can be initialized from a flat rectangle (a), a cylindrical portion (b) or a developable surface (c). ","ImageText":[{"Text":"(a)","TextBB":[127.614,701.294,139.901,711.256],"Rotation":0},{"Text":"(b)","TextBB":[231.728,701.294,244.635,711.256],"Rotation":0},{"Text":"(c)","TextBB":[336.164,701.294,348.451,711.256],"Rotation":0}],"Mention":["In this paper, we consider that a fac¸ade has a dominant planar struc-\nture. Therefore, a fac¸ade is a flat plane with a depth field on the\nplane. We also expect and assume that the depth variation within a\nsimple fac¸ade is moderate. A real building fac¸ade having complex\ngeometry and topology could therefore be broken down into mul-\ntiple simple fac¸ades. A building is merely a collection of fac¸ades,\nand a street is a collection of buildings. The dominant plane of the\nmajority of the fac¸ades is flat, but it can be curved sometimes as\nwell. We also consider the dominant surface structure to be any\ncylinder portion or any developable surface that can be swept by a\nstraight line as illustrated in Figure 3. To ease the description, but\nwithout loss of generality, we use a flat fac¸ade in the remainder of\nthe paper. For the developable surface, the same methods as for flat\nfac¸ades in all steps are used, with trivial surface parameterizations.\nSome cylindrical fac¸ade examples are given in the experiments.\n","Traditionally, data cost is defined as the photo consistency be-\ntween multiple images. Here, we use the photo consistency by\nmeans of the point set that we obtain from Structure From Mo-\ntion. This reverse way of using photo consistency is more ro-\nbust and is the key reason for achieving the great accuracy of the\ntop performance multi-view stereo method [Furukawa and Ponce\n2007]. As shown in Figure 9(c), the 3D points close to the working\nfac¸ade (within 0.8 meter) and with projections inside the subdivi-\n","• Hennepin Avenue, Minneapolis. Shown in Figure 13, these\nimages were captured by a set of cameras mounted on a vehi-\ncle equipped with an GPS\/INS system. Each camera has a res-\nolution of 1024×1360. The main portion of the Hennepin av-\nenue was covered by a sequence of 130 views using only one\nof the side-looking cameras. An additional sequence of seven\nviewing positions taken by an additional side camera pointed\n45 degrees up was used for the processing of the structure of\nthe masonic temple to capture the top part of the building. To\ngenerate a more homogeneous textured layer from multiple\nimages, the images were white balanced using the diagonal\nmodel of illumination change. The Hennepin Avenue in Fig-\nure 13 was modeled in about one hour. The Masonic Temple\nis the most difficult one to model and it took about 10 minutes\nincluding re-modeling.\n","• Re-modeling This option was tested in the example of Hen-\nnepin Avenue in Figure 13. The re-modeling results with 12\nre-modeling objects, shown in Figure 11(b) can be compared\nwith the results obtained without re-modeling shown in the\nright of Figure 10.\n"],"Page":3,"Number":3,"Type":"Figure","CaptionBB":[73,716,408,743],"Height":1100,"Width":850,"DPI":100,"ImageBB":[98,610,383,712]}