{"Caption":"Figure 4. Segmentation examples using the proposed edge preserving spatially variant mixture. From left to right, the columns show: the original image, segmentation with K = 5, K = 10 and K = 15 kernels. ","ImageText":[],"Mention":["ues of the number of segments (K = {3, 5, 7, 10, 15, 20}).\nFor comparison purposes, we have also experimented with\nthe standard GMM [1] and the GMM based segmentation\nwith ”standard” smoothness constraints [14] with the same\nnumber of components.\nThe obtained segmentations were quantitatively evalu-\nated with two performance measures: the Rand index (RI)\n[18] and the boundary displacement error (BDE) [10]. The\nRI measures the consistency between the ground truth and\nthe computed segmentation map while the BDE measures\nerror in terms of boundary displacement with respect to the\nground truth. The statistics for these measures are presented\nin tables 1 and 2.\nBased on the theoretical properties of the Student’s t-\nmodel one might have expected that the St-SVGMM in-\ntroduced erroneous boundaries that did not agree with hu-\nman segmentation. Therefore it would provide a worse RI\nas compared to the ”classical” non preserving algorithm\n(SVGMM) [14]. However, as observed in the statistics of\nthe RI (table 1), the St-SVGMM outperforms the standard\nGMM in all cases and the SVGMM in the overwhelming\nmajority of the different number of components.\nAlso, in terms of correct region boundary estimation, ex-\npressed by the BDE (table 2), the St-SVGMM outperforms\nthe SVGMM, as it is theoretically expected. However, it\nalso outperforms standard GMM and the difference in per-\nformance increases with the number of segments. The ex-\nplanation for this behavior is that the standard GMM since\nit does not integrate a smoothing step it generally computes\ncorrectly the boundaries between segments (it also outper-\nforms the SVGMM in the same median values). However,\nas the number of segments increases, the complexity of the\nimage cannot be captured by a simple GMM and smooth-\nness constraints that model the image edge structure be-\ncome increasingly beneficial.\nOverall, the St-SVGMM not only preserves region\nboundaries but also improves the correct classification rates\nwith respect to the standard methods. Some representative\nsegmentation examples are shown in figure 4.\n"],"Page":6,"Number":4,"Type":"Figure","CaptionBB":[79,701,769,731],"Height":1100,"Width":850,"DPI":100,"ImageBB":[138,63,712,700]}