{"Caption":"Figure 1: Statistical properties of natural images in a band-pass domain and their representations with the multivariate t model. (a): Marginal densities in the log domain (images: red solid curve, t model: blue dashed curve). (b): Contour plot of the joint density, p(x1 , x2 ), of adjacent pairs of band-pass filter responses. (c): Contour plot of the optimally fitted multivariate t model of p(x1 , x2 ). (d): Each column of the image correspond to a conditional density p(x1 |x2 ) of different x2 values. (e): The three red solid curves correspond to E(x1 |x2 ) and E(x1 |x2 ) ± std(x1 |x2 ). Blue dashed curves correspond to E(x1 |x2 ) and E(x1 |x2 ) ± std(x1 |x2 ) from the optimally fitted multivariate t model to p(x1 , x2 ). ","ImageText":[{"Text":"(a)","TextBB":[197.811,226.315,211.634,237.448],"Rotation":0},{"Text":"(b)","TextBB":[307.463,226.315,321.983,237.448],"Rotation":0},{"Text":"(c)","TextBB":[417.812,226.315,431.635,237.448],"Rotation":0},{"Text":"(d)","TextBB":[527.463,226.315,541.984,237.448],"Rotation":0},{"Text":"(e)","TextBB":[641.262,226.315,655.085,237.448],"Rotation":0}],"Mention":["- symmetric and sparse non-Gaussian marginal distributions with high kurtosis [7, 10], Fig.1(a);\n","- joint densities of neighboring responses that have elliptically symmetric (spherically symmetric\nafter whitening) contours of equal probability [34, 32]; Fig.1(b);\n","- conditional distributions of one response given neighboring responses that exhibit a “bow-tie”\nshape when visualized as an image [25, 6], Fig.1(d).\n","It has been noted that higher order statistical dependencies in the joint and conditional densities\n(Fig.1 (b) and (d)) cannot be effectively reduced with linear transform [17].\n","1The results in Fig.1 are obtained with spatial neighbors in images. Similar behaviors have also been\nobserved for orientation and scale neighbors [6], as well as other type of sensory signals such as audios [23, 17].\n","where α > 0 is the scale parameter and β > 1 is the shape parameter. Σ is a symmetric and positive\ndefinite matrix, and Γ(·) is the Gamma function. From data of neighboring responses of natural\nsensory signals in the band-pass domain, the parameters (α, β) in the multivariate t model can be\nobtained numerically with maximum likelihood, the details of which are given in the supplementary\nmaterial.. The joint density of the fitted multivariate t model has elliptically symmetric level curves\nof equal probability, and its marginals are 1D Student’s t densities that are non-Gaussian and kurtotic\n[14], all resembling those of the natural sensory signals, Fig.1(a) and (c). It is due to its heavy tail\nproperty that the multivariate t model has been used as models of natural images [35, 22].\n","demonstrated in Fig.1(e). The three red solid curves correspond to E(x\n","On the other hand, our observation based on the multivariate t model that the DN transform tends to\nincrease statistical dependency for small pooling size also holds to real data. Indeed, the increment\nof MI becomes more severe for d ≤ 4. On the surface, our finding seems to be in contradiction\nwith [23], where it was empirically shown that applying an equivalent form of the DN transform as\nEq.(2) (see Section 3.2) over a pair of input neurons can reduce statistical dependencies. However,\none key yet subtle difference is that statistical dependency is defined as the correlations in the con-\nditional variances in [23], i.e., the bow-tie behavior as in Fig.1(d). The observation made in [23]\nis then based on the empirical observations that after applying DN transform, such dependencies\nin the transformed variables become weaker, while our results show that the statistical dependency\nmeasured by MI in that case actually increases.\n"],"Page":2,"Number":1,"Type":"Figure","CaptionBB":[148,240,700,337],"Height":1100,"Width":850,"DPI":100,"ImageBB":[148,113,702,239]}