{"Caption":"Figure 1: Interface to XAI for OOS","ImageText":[],"Mention":["An additional source of information is the simulation sce-\nnario which contains the static information associated with\nthe simulated world, and the mission table. The static in-\nformation defines all the entities including their rank, unit,\nand weapons carried. The mission table contains a series\nof unit tasks and their parameters (e.g., unit task = clear\nroom(agent,room), agent = fireteam 1, room = east room of\nthe warehouse). During the simulation, entities perform indi-\nvidual tasks in service of these unit tasks, and log files record\nthe states of these entities (e.g., when they start and end tasks)\nand information about any weapon fire events. After the sim-\nulation is complete, XAI loads the log files into its relational\ndatabase and the query generator searches for “interesting”\ntime points. The time menu on XAI’s interface is sensitive to\nthe current entity (i.e., it displays the interesting time points\nfor that entity). For each entity, the query generator identifies\ninteresting times, defined as when the entity fired its weapon\nand the start, end, and mid points of entity tasks. This defini-\ntion of interesting times is a placeholder; when deploying an\nXAI system, feedback from subject matter experts is vital for\ndefining what questions the system should answer and what\nevents are interesting.\nAfter this initialization process is complete, the user can\ninvestigate the results of the simulation using the interface\nshown in figure 1. The screenshot shows 12 of the 16 ques-\ntions supported by the system and includes questions about\nthe entities’ state (e.g., “What is your health\/damage status”),\nquestions about the scenario (e.g., “Who are the other mem-\nbers of your unit”), and questions about tasks. The user can\nask for descriptions of the current individual (primitive) task,\nthe current group task, parameters of the task, or how, in gen-\neral, to perform the task.\nAlthough this list of questions reflects our research into\nquestions asked during military after action reviews, they are\nlimited to information directly encoded in the log files. In our\ncurrent architecture, the query manager executes queries to\nretrieve answers to questions. In future work, we will replace\nthis component with a general purpose XAI reasoner capable\nof answering the more complicated questions necessary for\nmilitary training purposes. Another influence on what ques-\ntions can be answered is the completeness of the simulator’s\nlog files. In [Gomboc et al., 2005] we discuss requirements\nfor such log files and how the requirements impact what ques-\ntions can be answered.\nThe question list is context sensitive, and all 16 questions\nare not always available. If the query generator determines\nthat there was no weapon fire event at the current time, then\nweapon fire questions (13-15) will be removed from the list.\nThe question list is also sensitive to the dialogue history as\nthe request, “Can you give me more detail?”, can only be\nmade when the previous turn described the current unit task,\nor described how to perform a unit task; currently our system\nis only able to elaborate on these two answers.\nThe interface to XAI for OOS is controlled by a servlet en-\ngine that communicates via XML with the explainer. Users\nselect an entity and a time point from the menus on the bot-\ntom of the screen, and then select a question from the same\n"],"Page":2,"Number":1,"Type":"Figure","CaptionBB":[325,512,524,526],"Height":1100,"Width":850,"DPI":100,"ImageBB":[191,12,662,490]}