{"Caption":"Figure 2: Information Logged","ImageText":[{"Text":"(a)","TextBB":[188,230.827,204.32,243.28],"Rotation":0},{"Text":"Plugin","TextBB":[208.508,230.827,244.771,243.28],"Rotation":0},{"Text":"Records","TextBB":[249.16,230.827,293.533,243.28],"Rotation":0},{"Text":"(b)","TextBB":[145.667,420.827,162.819,433.28],"Rotation":0},{"Text":"Packet-Level","TextBB":[166.841,420.827,237.711,433.28],"Rotation":0},{"Text":"Capture","TextBB":[241.822,420.827,287.349,433.28],"Rotation":0},{"Text":"Records","TextBB":[291.655,420.827,336.028,433.28],"Rotation":0}],"Mention":["We perform a network level capture using wireshark or\ntcpdump to record all the data packets exchanged during\na web session. For convenience we write all the raw data\npackets into a database management system. We use Post-\ngreSQL [4] as our DBMS, the PL\/PgSQL as its program-\nming language, and the Intrabase system shown in Fig. 2(b)\nfor TCP connection analysis is developed by Siekkinen [15].\n","tive user experience. For this purpose, we have already im-\nplemented a user feedback bottom (c.f. Fig. 2(a)) that allows\nthe user indicate whether he is satisfied or dissatisfied with\nthe speed at which the current Web page was displayed.\nWith the user feedback we also record the timestamp to\nbe able to relate the feedback to the events preceding the\nfeedback.\nWe have positioned our work as trouble shooting in a home\nenvironment. We think the home is a very good starting\npoint, since in many homes we have multiple networked de-\nvices such as PCs, laptops, smart phones or tablets that can\nall be used to access the Web. Correlating the observations\nmade on the different devices in the same home poses not\nmuch of an issue in terms of privacy. However, sharing in-\nformation for trouble shooting among devices in different\nhomes requires first a careful evaluation of potential privacy\nviolations. In this context, the work on differential privacy\nby Drowk [9] can provide a solid foundation for reasoning\nabout how to share information among clients in different\nhomes while maintaining privacy guarantees.\n"],"Page":2,"Number":2,"Type":"Figure","CaptionBB":[143,453,337,467],"Height":1169,"Width":826,"DPI":100,"ImageBB":[99,73,382,436]}