{"Caption":"Figure 4: Interactive texture refinement: (a) drawn strokes on the object to indicate removal. (b) the object is removed. (c) automati- cally inpainting. (d) some green lines drawn to guide the structure. (e) better result achieved with the guide lines. ","ImageText":[{"Text":"(a)","TextBB":[81.2153,150.656,93.5024,160.619],"Rotation":0},{"Text":"Indicate","TextBB":[98.074,150.656,133.729,160.619],"Rotation":0},{"Text":"(b)","TextBB":[147.578,150.656,160.485,160.619],"Rotation":0},{"Text":"Remove","TextBB":[165.045,150.656,201.63,160.619],"Rotation":0},{"Text":"(c)","TextBB":[217.615,150.656,229.902,160.619],"Rotation":0},{"Text":"Inpaint","TextBB":[234.474,150.656,265.834,160.619],"Rotation":0},{"Text":"(d)","TextBB":[286.59,150.656,299.497,160.619],"Rotation":0},{"Text":"Guide","TextBB":[304.058,150.656,331.112,160.619],"Rotation":0},{"Text":"(e)","TextBB":[353.401,150.656,365.688,160.619],"Rotation":0},{"Text":"Result","TextBB":[370.249,150.656,398.532,160.619],"Rotation":0}],"Mention":["are filled using patch-based texture synthesis as in Figure 4(e).\n","As shown in Figure 4, if the automatic texture composition result is\nnot satisfactory, a two-step interactive user interface is provided for\nrefinement. In the first step, the user can draw strokes to indicate\nwhich object or part of the texture is undesirable as in Figure 4(a).\nThe corresponding region is automatically extracted based on the\ninput strokes as in Figure 4(b) using the method in [Li et al. 2004].\nThe removal operation can be interpreted as that the most fronto-\nparallel and photo-consistent texture selection, from the result of\nAlgorithm 1, is not what the user wants. For each pixel, n̂ from\nLine 9 of Algorithm 1 and V should be wrong. Hence, P is up-\ndated to exclude V: P ← O. Then, if P 6= ∅, Algorithm 1 is\nrun again. Otherwise, image inpainting [Criminisi et al. 2003] is\nused for automatically inpainting as in Figure 4(c). In the second\nstep, if the automatic texture filling is poor, the user can manually\nspecify important missing structural information by extending a few\ncurves or line segments from the known to the unknown regions as\nin Figure 4(d). Then, as in [Sun et al. 2005], image patches are syn-\nthesized along these user-specified curves in the unknown region\nusing patches selected around the curves in the known region by\nLoopy Belief Propagation to find the optimal patches. After com-\npleting the structural propagation, the remaining unknown regions\n"],"Page":4,"Number":4,"Type":"Figure","CaptionBB":[73,168,408,223],"Height":1100,"Width":850,"DPI":100,"ImageBB":[73,74,410,163]}