{"Caption":"Figure 5: Rules for transforming an arbitrary cut family into a laminar one for the CSCP. The dark cuts in this figure correspond to the terminal i, and the light cuts to terminal j; t lies outside all the cuts. ","ImageText":[{"Text":"(c)","TextBB":[501.753,107.565,515.513,119.071],"Rotation":0},{"Text":"(b)","TextBB":[369.06,107.57,384.075,119.077],"Rotation":0},{"Text":"(a)","TextBB":[238.507,109.219,252.895,120.726],"Rotation":0},{"Text":"i","TextBB":[264.48,139.589,268.32,150.142],"Rotation":0},{"Text":"j","TextBB":[324.527,137.853,329.182,148.405],"Rotation":0},{"Text":"i","TextBB":[264.818,240.534,268.657,251.087],"Rotation":0},{"Text":"j","TextBB":[325.48,239.763,330.136,250.316],"Rotation":0},{"Text":"i","TextBB":[424.975,140.604,428.814,151.156],"Rotation":0},{"Text":"j","TextBB":[453.501,140.739,458.157,151.292],"Rotation":0},{"Text":"i","TextBB":[424.656,237.769,428.495,248.321],"Rotation":0},{"Text":"j","TextBB":[453.501,236.829,458.157,247.382],"Rotation":0},{"Text":"i","TextBB":[556.707,130.983,560.546,141.535],"Rotation":0},{"Text":"j","TextBB":[556.387,149.387,561.042,159.94],"Rotation":0},{"Text":"i","TextBB":[557.347,228.148,561.187,238.701],"Rotation":0},{"Text":"j","TextBB":[558.31,247.401,562.966,257.953],"Rotation":0}],"Mention":["3. While there are pairs of cuts in C that cross, consider any pair of cuts Ci, Cj ∈ C belonging to terminals i 6= j\nthat cross each other. Transform these cuts into new cuts for i and j according to Figure 5.\n","We prove Lemma 1 in this section. Our algorithm involves starting with a solution toMCP-LP, converting\nit into a feasible fractional non-laminar family of cuts, and then resolving pairs of crossing cuts one at a\ntime by applying the rules in Figure 5. The algorithm is given in Figure 4.\n","to see from Figure 5 that the load on every edge stays the same. Finally, in every iteration of this step, the\nnumber of pairs of crossing cuts strictly decreases. Therefore, the algorithm ends after a polynomial number\nof iterations.\n","Obtaining laminarity in the general case involves a more careful selection and ordering of rules of the form\ngiven in Figure 5. The key complication in this case is that we must maintain separation of every terminal\nfrom every other terminal in its commodity set. We first show how to convert an integral collection of cuts\nfeasible for the MCP into a feasible integral laminar collection of cuts. We lose a factor of 2 in edge loads\nin this process (see Lemma 14 below). Obtaining laminarity for an arbitrary fractional solution requires\nconverting it first into an integral solution for a related cut-packing problem and then applying Lemma 14\n(see algorithm Lam-2 in Figure 8 and the proof of Lemma 2 following it).\n"],"Page":15,"Number":5,"Type":"Figure","CaptionBB":[98,320,750,355],"Height":1100,"Width":850,"DPI":100,"ImageBB":[232,99,619,303]}