{"Caption":"   Figure 2: 3 different sizes of an example target used in the                         comparison task. To clarify how size of the display relates to the size of a given target, we have provided table 2. The display size to target size ratio is simply the total pixel count for a given display divided by a given target size. For example, the size of the one monitor configuration compared to a large target is 3.2 (or 3200 times bigger) while the nine monitor configuration divided by a large target is 28.9 (28900 times bigger). Ratios have been divided by 1000 for convenience. ","ImageText":[{"Text":"A)","TextBB":[484.044,434.772,497.199,451.037],"Rotation":0},{"Text":"Large","TextBB":[500.378,434.772,532.253,451.037],"Rotation":0},{"Text":"B)","TextBB":[584.05,434.772,596.706,451.037],"Rotation":0},{"Text":"Medium","TextBB":[599.718,434.772,644.947,451.037],"Rotation":0},{"Text":"C)","TextBB":[684.057,434.772,697.212,451.037],"Rotation":0},{"Text":"Small","TextBB":[700.391,434.772,730.862,451.037],"Rotation":0}],"Mention":["Since the granularity or scale of the targets within the 2D \ndata space is likely to affect user tasks at various display \nresolutions, we varied target size to measure the effect.  An \nexample target at the three different sizes used in the \nexperiment is shown in Figure 2. \n","Two basic visualization tasks are examined: finding a single \ntarget, and identifying paired targets in a high-resolution \nimage.  The first task consisted of finding a red dot out of \nthousands of gray ones. The second task, a comparison task, \nconsisted of finding red targets in an image and identifying \nidentical pairs. The second task was more sophisticated \nthan the first task in that the participants had to first find the \nred targets then compare all of the targets with each other to \nidentify pairs that had identical shape.  Figure 2 shows an \nexample of one target shape used in the comparison task. \n"],"Page":2,"Number":2,"Type":"Figure","CaptionBB":[438,455,775,623],"Height":1100,"Width":850,"DPI":100,"ImageBB":[460,360,755,451]}