{"Caption":"Figure 8. Example videos of KTH data set. The bounding boxes (solid box for the manual setting, the dashed one for the automatic detection) indicate the spatial alignment and the superimposed im- ages of the initial, intermediate and the last frames of each action show the temporal segmentation. ","ImageText":[],"Mention":["data base [6]. The data set contains six types (boxing, hand\nclapping, hand waving, jogging, running and walking) of\nhuman actions performed by 25 subjects in 4 different\nscenarios. Leave-one-out cross-validation was performed\nto test the proposed method, i.e. for each run the videos\nof 24 subjects are exploited for training and the videos of\nthe remaining subject is for testing. Some sample videos\nare shown in Figure 8 with the indication of the action\nalignment. In TCCA method, the aligned video sequences\nwere uniformly resized to 20 × 20 × 20. This space-time\nalignment of actions was manually done for accuracy\ncomparison but can also be automatically achieved by the\nproposed detection scheme. See Table 3 for the accuracy\ncomparison of several methods and Figure 9 for the con-\nfusion matrix of our method. The competing methods are\nbased on histogram representations of the local space-time\ninterest points with SVM (Dollar et al [5], Schuldt et\nal. [6]) or pLSA (Niebles et al. [3]). Ke et al. applied\nthe spatio-temporal volumetric features [7]. While the\nprevious methods delivered the accuracy around 60-80%,\nthe proposed method achieved impressive accuracy at 95%.\nThe previous methods lost important information in the\nglobal space-time shapes of actions resulting in ambigu-\nity for more complex spatial variations of the action classes.\n","Action Detection on KTH Data Set. The action detec-\ntion was performed by the training set consisting of the se-\nquences of the five persons, which do not contain any test-\ning persons. The scale (also the aspect ratio of axes) of\nactions were class-wise fixed. Figure 8 shows the proposed\ndetection results by the dashed bounding boxes, which are\n"],"Page":7,"Number":8,"Type":"Figure","CaptionBB":[427,270,757,344],"Height":1169,"Width":826,"DPI":100,"ImageBB":[436,99,750,268]}