{"Caption":"Figure 2: Example Personal Device Scenario","ImageText":[],"Mention":["A user can introduce UIA devices either to merge his\nown devices into a personal group sharing a common\nnamespace, or to create named links from his own group\nto other users’ personal groups. The following sections\ndescribe these two forms of introduction, and other im-\nportant group management actions, with the help of an\nexample scenario illustrated in Figure 2.\n","Bob now returns home and merges his cell phone with his\nhome phone, as shown at Time 4 in Figure 2. Bob’s home\nphone in turn gossips the cell phone’s group membership\nto Bob’s laptop, so the laptop and cell phone can name\n","Returning to the scenario in Figure 2, Bob loses his cell\nphone at Time 7, and he is not sure whether it was stolen\nor just temporarilymisplaced. If the cell phonewas stolen\nand has no local user authentication such as a password or\nfingerprint reader, the thief might obtain not only Bob’s\ndata on the cell phone itself, but also remote access to\nservices authorized to his personal group via UIA names.\nUIA devices capable of accessing sensitive information\nremotely should therefore provide strong local user au-\nthentication, and should encrypt personal data (including\nUIA state) stored on the device, as Apple’s FileVault does\nfor example [3]. The details of local user authentication\nand encryption are orthogonal to UIA, however.\nTo minimize potential damage if a thief does break into\nBob’s user account on his cell phone, Bob can revoke\nthe cell phone’s ownership of his personal group. If the\ncell phone re-appears and Bob realizes that he just mis-\nplaced it, then he can “undo” the revocation and return\nthe phone to its normal status. If the cell phone remains\nmissing, however, UIA ensures that no one can remotely\naccess personal information or services on Bob’s other\ndevices via the lost phone once the revocation announce-\nment has propagated to those devices. Similarly, the cell\nphone loses its access to the files Alice shared with Bob\nas soon as Alice’s PC, on which the files reside, learns of\nthe revocation from any of Bob’s remaining devices.\n","Whereas DNS resolution traverses a strictly hierarchi-\ncal tree of “zones” starting from a centrally-managed\nglobal root zone, each UIA device has a unique root for\nresolving UIA names, and users can link UIA groups to\nform arbitrary graphs. After Bob meets Alice at Time 3 in\nFigure 2, for example, Bob’s “root” group for UIA name\nresolution, corresponding to his personal group, appears\nto Alice as a “sub-group” named Bob. Conversely, Al-\nice’s “root” group appears to Bob as a “sub-group” named\nAlice. Since Bob’s and Alice’s naming relationship\nforms a cycle in the graph of UIA groups, Bob could for\nexample refer to his own phone via the redundant name\nphone.Bob.Alice.\n","at the events in the example scenario from Figure 2. The\nfollowing section will then explain how devices evaluate\nthe contents of their logs to determine the effective state\nof each group at any point in time.\n"],"Type":"Figure","Number":2,"Page":4,"CaptionBB":[142,969,368,982],"Height":1100,"Width":850,"DPI":100,"ImageBB":[96,120,420,962]}