{"Caption":"Figure 4: The results of coordinate descent machine learning are shown. The learning generated the race parameters of .25 Gs and 1 mph\/s, a good match to human driving. Note that the human often drives under the speed limit. This suggests the importance of our algorithm for desert driving. ","ImageText":[],"Mention":["We do not model driver reaction time, and we correct for\nthe delay due to IMU filtering. Thus, in this data, driver ve-\nlocity at position p is the vehicle’s recorded velocity at po-\nsition p, according to the UKF. The algorithm’s velocity at\nposition p is the decision of the velocity controller consider-\ning all data up to and including the IMU and UKF data points\nlogged at position p.\nThe parameterization learned was (α, β) = (.27 Gs,\n.909 mph\/s). This is illustrated in Figure 4. The top and\nbottom halves of the figure show the training and test sets,\nrespectively. The horizontal axis is position along the 2004\nGrand Challenge route in miles. The vertical axis is speed\nin mph. For practical reasons we rounded these parameters\nto .25 and 1, respectively, which are essentially identical in\nterms of vehicle performance. The robot used these parame-\nters during the Grand Challenge event and they are evaluated\nextensively in future sections.\nWe notice a reasonable match to human driving. Without\nthe penalty for speeding, a closer match is possible. However,\nthat parameterization causes the vehicle to drive too aggres-\nsively. This is, no doubt, because a human driver also uses\nperceptual cues to determine speed.\nNotice that the speed limits are often much greater than\nthe safe speed the human (and the algorithm) selects. This\ndemonstrates the importance of our technique over blindly\nfollowing the provided speed limits. Notice also, however,\nboth the human and the algorithm at times exceed the speed\nlimit. This is not allowed on the actual robot or in the experi-\nments in Section 4. However, we permit it here to simplify the\nscoring function, the learning process, and the idea of match-\ning a human driver’s speed.\n"],"Page":4,"Number":4,"Type":"Figure","CaptionBB":[73,357,413,434],"Height":1169,"Width":826,"DPI":100,"ImageBB":[83,77,404,336]}