{"Caption":"Figure 1: (a) Training stimuli in complex and simple goal conditions. (b) Test stimuli 1 and 2. Test stimuli was the same for each group. (c) Mean of subjects’ ratings with standard error bars (n=16). ","ImageText":[{"Text":"(b)","TextBB":[444.524,522.055,459.299,532.954],"Rotation":0},{"Text":"Test","TextBB":[467.281,523.11,488.396,534.183],"Rotation":0},{"Text":"paths","TextBB":[491.613,523.11,519.913,534.183],"Rotation":0},{"Text":"1","TextBB":[228.821,639.372,234.794,649.653],"Rotation":0},{"Text":"2","TextBB":[289.152,639.372,295.125,649.653],"Rotation":0},{"Text":"3","TextBB":[348.656,639.372,354.63,649.653],"Rotation":0},{"Text":"#","TextBB":[300.619,651.83,306.593,662.112],"Rotation":0},{"Text":"stimuli","TextBB":[309.579,651.83,339.91,662.112],"Rotation":0},{"Text":"4","TextBB":[409.813,639.372,415.786,649.653],"Rotation":0},{"Text":"(c)","TextBB":[540.392,522.055,554.531,532.954],"Rotation":0},{"Text":"1","TextBB":[509.814,542.935,515.328,552.426],"Rotation":0},{"Text":"2","TextBB":[509.814,597.48,515.328,606.971],"Rotation":0},{"Text":"Cond:","TextBB":[589.183,525.011,617.847,535.293],"Rotation":0},{"Text":"simple","TextBB":[620.835,525.011,651.873,535.293],"Rotation":0},{"Text":"Cond:","TextBB":[589.183,537.908,617.847,548.19],"Rotation":0},{"Text":"complex","TextBB":[620.835,537.908,660.833,548.19],"Rotation":0},{"Text":"7","TextBB":[550.837,543.678,556.811,553.96],"Rotation":0},{"Text":"rating","TextBB":[537.651,569.07,548.723,597.892],"Rotation":3},{"Text":"(both","TextBB":[450.798,592.182,461.87,618.551],"Rotation":3},{"Text":"groups)","TextBB":[450.798,549.859,461.87,588.967],"Rotation":3},{"Text":"simple","TextBB":[190.721,541.035,201.794,574.461],"Rotation":3},{"Text":"Training","TextBB":[281.596,523.11,321.883,534.183],"Rotation":0},{"Text":"paths","TextBB":[325.099,523.11,353.399,534.183],"Rotation":0},{"Text":"complex","TextBB":[190.62,589.948,201.693,632.676],"Rotation":3},{"Text":"Training","TextBB":[176.511,580.944,188.374,624.108],"Rotation":3},{"Text":"cond","TextBB":[176.511,550.622,188.374,577.498],"Rotation":3},{"Text":"(a)","TextBB":[176.756,522.055,190.895,532.954],"Rotation":0},{"Text":"5","TextBB":[550.837,573.078,556.811,583.36],"Rotation":0},{"Text":"3","TextBB":[550.837,602.529,556.811,612.81],"Rotation":0},{"Text":"1","TextBB":[550.837,631.979,556.811,642.261],"Rotation":0},{"Text":"1","TextBB":[561.951,639.372,567.925,649.654],"Rotation":0},{"Text":"2","TextBB":[596.943,639.372,602.916,649.654],"Rotation":0},{"Text":"3","TextBB":[631.884,639.372,637.858,649.654],"Rotation":0},{"Text":"#","TextBB":[598.245,651.83,604.218,662.112],"Rotation":0},{"Text":"stimuli","TextBB":[607.205,651.83,637.535,662.112],"Rotation":0},{"Text":"4","TextBB":[666.875,639.372,672.849,649.654],"Rotation":0}],"Mention":["Sixteen observers were told that they would be watching a series of animations of a mouse\nrunning in a simple maze (a box with a single internal wall). The displays were shown\nfrom an overhead perspective, with an animated schematic trace of the mouse’s path as it\nran through the box. In each display, the mouse was placed in a different starting location\nand ran to recover a piece of cheese at a fixed, previously learned location. Observers were\ntold that the mouse had learned to follow a more-or-less direct path to the cheese, regardless\nof its starting location. Subjects saw two conditions in counterbalanced order. In one con-\ndition (“simple goal”), observers saw four displays consistent with this prior knowledge.\nIn another condition (“complex goal”), observers saw movements suggestive of a more\ncomplex, path-dependent goal for the mouse: it first ran directly to a particular location in\nthe middle of the box (the “via-point”), and only then ran to the cheese. Fig. 1(a) shows\nthe mouse’s four trajectories in each of these conditions. Note that the first trajectory was\nthe same in both conditions, while the next three were different. Also, all four trajecto-\nries in both conditions passed through the same hypothetical via-point in the middle of the\nbox, which was not marked in any conspicuous way. Hence both the simple goal (“get to\n","Observers’ interpretations were assessed after viewing each of the four trajectories, by\nshowing them diagrams of two test paths (Fig. 1(b)) running from a novel starting location\nto the cheese. They were asked to rate the probability of the mouse taking one or the other\ntest path using a 1-7 scale: 1 = definitely path 1, 7 = definitely path 2, with intermediate\nvalues expressing intermediate degrees of confidence. Observers in the simple-goal condi-\ntion always leaned towards path 1, the direct route that was consistent with the given prior\nknowledge. Observers in the complex-goal condition initially leaned just as much towards\npath 1, but after seeing additional trajectories they became increasingly confident that the\nmouse would follow path 2 (Fig. 1(c)). Importantly, the latter group increased its average\nconfidence in path 2 with each subsequent trajectory viewed, consistent with the notion that\ngoal inference results from something like a Bayesian integration process: prior probability\nfavors the simple goal, but successive observations are more likely under the complex goal.\n","0:T\n, such as the test stimuli in Fig. 1, conditioned on an observed sequence s\n","Lastly, we present the results of our model on our own behavioral experiment, first de-\nscribed in ยง2.3 and shown in Fig. 1. These data demonstrated the statistical nature of peo-\nple’s intentional inferences. Fig. 5 compares people’s judgments of the probability that the\nagent takes a particular test path with our model’s predictions. To place model predictions\nand human judgments on a comparable scale, we fit a sigmoidal psychometric transforma-\ntion to the computed log posterior odds for the curved test path versus the straight path. The\nBayesian model captures the graded shift in people’s expectations in the “complex goal”\ncondition, as evidence accumulates that the agent always seeks to pass through an arbitrary\nvia-point enroute to the end state.\n"],"Page":3,"Number":1,"Type":"Figure","CaptionBB":[173,665,675,692],"Height":1100,"Width":850,"DPI":100,"ImageBB":[174,519,677,662]}