{"Caption":"Figure 5. Probability distributions for project duration and number of people when FP=1000","ImageText":[{"Text":"Probability","TextBB":[471.056,119.047,565.066,137.947],"Rotation":0},{"Text":"Probability","TextBB":[72.8889,124.547,166.9,143.447],"Rotation":0},{"Text":"Project","TextBB":[222.056,146.263,286.626,166.813],"Rotation":0},{"Text":"duration","TextBB":[292.323,146.263,368.559,166.813],"Rotation":0},{"Text":"(months)","TextBB":[374.144,146.263,456.867,166.813],"Rotation":0},{"Text":"Number","TextBB":[597.389,145.096,672.004,165.646],"Rotation":0},{"Text":"of","TextBB":[677.735,145.096,696.673,165.646],"Rotation":0},{"Text":"people","TextBB":[702.571,145.096,763.376,165.646],"Rotation":0}],"Mention":["In this example we consider a 1000 FP (function \npoint) project and compare the predictions made using \nour model with published data and other resource \nprediction models.  We show that our model, in its \n‘dumbest sense’ is consistent with published data and \nmodels, but also that it provides greater insight. \nEntering a value of 1000 for the number of function \npoints delivered results in the distributions for project \nduration and number of people shown in Figure 5 (this \nfigure shows how probability distributions are displayed \nin the toolset we describe in Section 6).  \n","Our experience from earlier commercial projects such \nas [14, 25] is that project managers and other users who \nare not BN experts do not wish to use a BN directly via a \ngeneral purpose BN editor.  Instead, the BN needs to be \nhidden behind a more specialised user interface. The \ntoolset provided by MODIST is actually an application \ngenerator that enables toolset users to tailor both the \nunderlying BN models and the user interface that is \nprovided to the end-users when the application is \ngenerated.  \nThe main functions provided to the end-user are:  \n1. Observations can be entered using a questionnaire \ninterface, where questions correspond to BN \nvariables.  Each question includes an explanation \nand the user can select a state (if the number of \nstates is small) or enter a number (if the states of \nthe variable are intervals in a numeric range).  \nAnswers given are collected into ‘scenarios’ that \ncan be named and saved.  At least one scenario is \ncreated for each software development project but \nit is possible to create and compare multiple \nscenarios for a project. \n2. Predictions are displayed as probability \ndistributions and as summary statistics (mean, \nmedian, variance).  Distributions are displayed \neither as bar charts (see Figure 7) or as line graphs \n(see Figure 5) depending on the type of variable \nand the number of states.  The predictions for \nseveral scenarios can be superimposed for ease of \ncomparison (as shown in Figure 6).  Summary \nstatistics can be exported to a spreadsheet. \n"],"Page":6,"Number":5,"Type":"Figure","CaptionBB":[152,347,704,361],"Height":1100,"Width":850,"DPI":100,"ImageBB":[71,116,766,339]}