{"Caption":"Figure 1: DiamondHelp for combination washer-dryer.","ImageText":[{"Text":"Garland,","TextBB":[448.82,184.548,502.26,197.001],"Rotation":0},{"Text":"Shane","TextBB":[505.719,184.548,541.863,197.001],"Rotation":0},{"Text":"Booth,","TextBB":[545.322,184.548,584.15,197.001],"Rotation":0},{"Text":"Markus","TextBB":[587.61,184.548,634.505,197.001],"Rotation":0},{"Text":"Chimani","TextBB":[637.964,184.548,689.468,197.001],"Rotation":0},{"Text":"Laboratories","TextBB":[471.693,203.918,541.628,216.372],"Rotation":0},{"Text":"02139,","TextBB":[439.222,237.128,477.275,249.582],"Rotation":0},{"Text":"USA","TextBB":[480.735,237.128,508.41,249.582],"Rotation":0}],"Mention":["The first two of these components are oriented towards the\nuser; the third component addresses the needs of the software\ndeveloper. Each of these components is described in detail in\na section below. Figure 1 shows an example of the Diamond-\nHelp user interface design for a combination washer-dryer.\n","In order to address these concerns, we divided the screen into\ntwo areas, as shown in the example DiamondHelp interfaces\nof Figures 1, 3 and 4. Figure 1 has been implemented in Java;\n","From a design perspective, this means that the wording of\nthe text displayed for each things-to-say choice should read\nnaturally as an utterance by the user in the context of the\nongoing conversation. For example, in Figure 1, in reply\nto the system’s question “How can I help you?”, one of the\nthings-to-say choices is “Explain wash agitation,” not “wash\nagitation.”\n","The oval beads on each side of the upper half of the screen\nin Figures 1, 3 and 4 are standard scroll bar sliders. We also\nsupport scrolling by simply dragging anywhere on the lined\nbackground of the upper window.\n","The bottom half of each screen in Figures 1, 3 and 4 is an\napplication-specific direct manipulation interface. The de-\ntails of these GUI’s are not important to the main point of this\npaper. If fact, there is nothing in the DiamondHelp frame-\nwork that guarantees or relies upon the application GUI be-\ning well-designed or even that it follow the direct manipula-\ntion paradigm, though this is recommended. (The only way\nto guarantee this would be for DiamondHelp to automati-\ncally generate the application GUI from a task model. We\nhave done some research on this approach [2], but it is still\nfar from practical.)\n","“What next?” has already been discussed above. “Never\nmind” is a way to end a question without answering it (see\nFigure 1). “Oops,” “Done,” and “Help” each initiate a subdi-\nalogue in which the system tries to determine, respectively,\nhow to recover from a mistake, what level of task goal has\nbeen completed, or what form of help the user desires.\n","An additional component of the DiamondHelp conversa-\ntional interface is the “task bar,” which is the single line lo-\ncated immediately above the scrollable history and below the\nDiamondHelp logo in Figures 1 and 4 (the task bar in Fig-\nure 3 happens to be blank at the moment of the screen shot).\nFor example, in Figure 1, the contents of the task bar reads:\n"],"Page":3,"Number":1,"Type":"Figure","CaptionBB":[454,559,760,573],"Height":1100,"Width":850,"DPI":100,"ImageBB":[424,181,778,542]}