{"Caption":"Figure 2. 2D space-time volumes: Each frame is represented by a 1D row, and the frames are aligned along the global u axis. A static camera defines a rectangular space-time region (a), while a moving camera defines a more general swept volume (b). Snapshots of an evolving time front surface produce a sequence of time slices; each time slice is mapped to produce a single output video frame. Time flow for generating dynamic mosaics from a panning camera is shown in (b). ","ImageText":[{"Text":"t","TextBB":[71.9486,183.201,76.4341,202.674],"Rotation":0},{"Text":"t","TextBB":[165.438,183.258,169.923,202.731],"Rotation":0},{"Text":"(a)","TextBB":[144.5,211.41,159.984,223.864],"Rotation":0},{"Text":"(b)","TextBB":[306.65,211.41,322.964,223.864],"Rotation":0}],"Mention":["Given a sequence of input video frames, they are first\nregistered and aligned to a global spatial coordinate sys-\ntem (u; v). Stacking the aligned video frames along the\ntime axis results in a 3D space-time volume (u; v; t). Fig. 2\nshows two examples of 2D space-time volumes. For a static\ncamera the volume is a rectangular box, while a moving\ncamera defines a more general swept volume. In either case,\nplanar slices perpendicular to the t axis correspond to the\noriginal video frames. A static scene point traces a line par-\nallel to the t axis (for a static or panning camera), while a\nmoving point traces a more general trajectory.\n","column (row) in the input sequence. This function can be\nrepresented by a continuous slice (time slice) in the space-\ntime (u-t) volume, as shown in Fig. 2. Each time slice deter-\nmines the mosaic strips by its intersection with the frames\nof the original sequence at the original discrete time values\n(shown as dashed lines in Fig. 2).\n","To get a desired time manipulation we specify an evolv-\ning time front: a free-form surface that deforms as it sweeps\nthrough the space-time volume. Taking snapshots of this\nsurface at different times results in a sequence of time slices\n(Figure 2). It should be noted that mosaicing with general\ntime slices cannot be done with strips, and more general 2D\nmosaicing methods should be used.\n","Panoramic dynamosaics may be generated using the\napproach described above with the time slices shown in\nFig. 2b. Assuming that the camera is scanning the scene\nleft-to-right, the first mosaic in the sequence will be con-\nstructed from strips taken from the right side of each input\nframe, showing regions as they first appear in the field of\nview (see Fig. 3). The last mosaic in the resulting sequence\nwill be the mosaic image generated from the strips on the\nleft, just before a region disappears from the field of view.\nBetween these two extreme slices of the space-time volume\nwe use intermediate panoramic images that are represented\nby time slices moving smoothly from the first slice to the\nlast slice. These slices are panoramic images, advancing\nalong the local time from the appearance slice to the dis-\nappearance slice, where the local dynamics of each region\nis preserved. Fig. 1 shows a single panorama from such a\nmovie.\n","An example of distorions due to a moving object is\nshown in Fig. 11. These distortions are caused by the street\nperformer, swaying quickly forward and backward. We\nhave therefore used a slope-adjusted time front to generate\nthe movie corresponding to Fig. 12. In this case, the shape\nof the time slice was determined by manually selecting re-\ngions that should have a smaller distortion.\n"],"Page":3,"Number":2,"Type":"Figure","CaptionBB":[68,240,398,360],"Height":1100,"Width":850,"DPI":100,"ImageBB":[70,32,400,225]}