{"Caption":"Figure 10: Scaled PageRank contribution of the first farm to the others. ","ImageText":[{"Text":"200","TextBB":[138.749,77.3951,151.013,84.1963],"Rotation":0},{"Text":"Scaled","TextBB":[129.294,176.695,136.095,199.172],"Rotation":3},{"Text":"PageRank","TextBB":[129.294,140.358,136.095,174.688],"Rotation":3},{"Text":"Contribution","TextBB":[129.294,98.7201,136.095,138.359],"Rotation":3},{"Text":"Complete","TextBB":[169.607,84.8737,201.069,91.675],"Rotation":0},{"Text":"175","TextBB":[138.749,94.6091,151.013,101.41],"Rotation":0},{"Text":"150","TextBB":[138.749,111.823,151.013,118.624],"Rotation":0},{"Text":"125","TextBB":[138.749,129.039,151.013,135.84],"Rotation":0},{"Text":"100","TextBB":[138.749,146.254,151.013,153.055],"Rotation":0},{"Text":"Ring","TextBB":[158.64,154.788,173.758,161.589],"Rotation":0},{"Text":"75","TextBB":[142.833,163.47,151.01,170.271],"Rotation":0},{"Text":"50","TextBB":[142.833,180.684,151.01,187.485],"Rotation":0},{"Text":"25","TextBB":[142.833,197.9,151.01,204.701],"Rotation":0},{"Text":"1","TextBB":[163.705,222.418,167.793,229.22],"Rotation":0},{"Text":"2","TextBB":[185.989,222.418,190.077,229.22],"Rotation":0},{"Text":"3","TextBB":[208.272,222.418,212.36,229.22],"Rotation":0},{"Text":"4","TextBB":[230.556,222.418,234.644,229.22],"Rotation":0},{"Text":"5","TextBB":[252.839,222.418,256.927,229.22],"Rotation":0},{"Text":"6","TextBB":[275.123,222.418,279.211,229.22],"Rotation":0},{"Text":"Farm","TextBB":[243.314,231.456,260.468,238.257],"Rotation":0},{"Text":"Number","TextBB":[262.488,231.456,288.634,238.257],"Rotation":0},{"Text":"7","TextBB":[297.407,222.418,301.495,229.22],"Rotation":0},{"Text":"8","TextBB":[319.69,222.418,323.778,229.22],"Rotation":0},{"Text":"9","TextBB":[341.974,222.418,346.062,229.22],"Rotation":0},{"Text":"10","TextBB":[362.214,222.418,370.391,229.22],"Rotation":0}],"Mention":["targets form a complete core.\nNow let us take a look at the PageRank of each tar-\nget in all three scenarios. Figure 9 presents the scores.\nThe horizontal axis marks the ten farms. The vertical\naxis corresponds to the scaled PageRank scores of the\ntargets. (We scaled the PageRank scores by multiply-\ning them by N, the total number of web pages. This\nway, the obtained scaled scores are independent of the\nsize of the web.) The three curves correspond to the\nthree scenarios.\nAs we can see, for unconnected farms the target\nPageRank is linear in the farm size. If the targets\nform a complete core, each of the target PageRank\nscores increases with respect to the unconnected case.\nMoreover, the increase is so that the smallest farm\ngains the most additional PageRank and the largest\ngains the least. Even more intriguing, in case of the\nweb ring some target scores increase while some others\ndrop below the unconnected case. In particular, the\ntarget of the largest farm in the ring loses score.\nFigure 10 helps us understand these phenomena. It\nshows the contributions of farm 1 to the PageRank\nscores of different target pages that are either in a\nring, or form a complete core. The horizontal axis once\nagain represents the farms. For each farm i, the verti-\ncal axis shows the fraction of the scaled PageRank of\n","that is due to the presence of farm 1 in the alliance.\nIntuitively, Figure 10 shows what advantage of each\n","Let us derive the formulas that yielded Figure 10.\nPlease note that Equation 5 and 6 can be easily decom-\nposed into independent terms corresponding to each\nfarm in the alliance. Accordingly, for a web ring the\nPageRank score contribution cr(i, i) of farm i to its\nown target i is\n","instead? We have seen in Figure 9 that target t10 had\na lower PageRank in a ring than it would have had if\n","Another situation that might arise is when a spammer\nparticipating in an alliance wishes to add more boost-\ning pages to its own farm. Such increase in the number\nof boosting pages increases the contribution of that\nfarm to its own target and all others in the alliance,\nfollowing the patterns shown in Figure 10. Obviously,\nthe more new boosting pages are added, the closer the\nfarm gets to the limit for leaving, as stated in Inequal-\nities 9 and 10. The question is, given the current size\nof farm i, how many pages need to be added to farm i\nbefore it is better off on its own?\nWe can find the answer to this question by tak-\ning a look at the difference between the minimum size\nas determined by Inequalities 9 and 10 and the cur-\nrent size of the farm. Figure 12 presents the corre-\nsponding results for our 10 spam farms connected ei-\nther in a ring or in an alliance with complete core.\nThe horizontal axis shows farm numbers, while the\nvertical axis represents the minimum number of addi-\ntional boosting pages a spammer should add, so that\nthe target PageRank after leaving the alliance would\nbe higher than the PageRank when staying in the al-\nliance. For instance, if farm 3 with a current number\nof 3000 boosting pages would receive approximately\n10000 more boosting pages, it could achieve higher\ntarget PageRank by splitting off from a complete-core\nalliance than staying within it. Please note that farm\n10 is already above the limit for the ring structure. In\nsuch an instance, the spammer might want to leave\nthe alliance, drop some boosting pages, or charge the\nothers for the “loss” incurred due to staying in the\nalliance.\n"],"Page":8,"Number":10,"Type":"Figure","CaptionBB":[88,257,415,287],"Height":1100,"Width":850,"DPI":100,"ImageBB":[127,75,380,239]}