{"Caption":"Figure 12: Quality comparison for an image compressed without filtering (left) and with invisible noise filtering (right). Both images were compressed to streams of approximately the same size. The strongly visible blocky artifacts in the image com- pressed without filtering become barely noticeable in the “filtered” image. Note that the artifacts may not be visible in print and should be observed on a gamma-2.2 mon- itor. No filtering: qscale = 6, bpp = 1.37, HDR VDP 75%= 3.12%; With filtering: qscale = 2, bpp = 1.23, HDR VDP 75%= 1.11%. ","ImageText":[],"Mention":["We validate the algorithm for \u0002ltering invisible noise, described in\nSection 3.4, for a range of MPEG quality settings. Figure 9 illus-\ntrates how the size of a residual stream is reduced when the \u0002ltering\nis used. Note that the largest savings are possible for the best quality\nsettings. This is because the strength of the \u0002ltering is determined\nby the visibility thresholds, which do not depend on quality set-\ntings. The \u0002ltering has a minimal impact on the stream size for low\nquality settings since the distortions introduced by the aggressive\nDCT quantization are far above the visibility thresholds used in the\n\u0002ltering. Figure 13 shows how both the total stream size and quality\nare affected when the residual frames are \u0002ltered. Although the \u0002l-\ntering in fact introduces changes that are detected by the HDR VDP\n(probably due to a mismatch in the visual models used by the \u0002lter-\ning and the HDR VDP), the loss of quality is fully compensated by\nthe bit-rate savings (see Figure 13). Moreover, we observe that the\nsubjective quality of \u0002ltered video is better than predicted by the\nHDR VDP. This is because the blurry artifacts due to the wavelet\nbased \u0002ltering are less objectionable than blocky artifacts of DCT\ncoding (see Figure 12). Although HDR VDP can predict the exis-\ntence of visible distortions, it can neither estimate their magnitude,\nnor their impact on perceived quality.\n"],"Page":9,"Number":12,"Type":"Figure","CaptionBB":[73,489,495,589],"Height":1100,"Width":850,"DPI":100,"ImageBB":[79,351,491,477]}