{"Caption":"Figure 6: Projections of good and poor result sets for query Wisconsin projected on the URL graph. ","ImageText":[{"Text":"Session:","TextBB":[647.222,43.8028,699.322,55.3653],"Rotation":0},{"Text":"Web","TextBB":[702.797,43.8028,729.185,55.3653],"Rotation":0},{"Text":"Graphs","TextBB":[732.66,43.8028,776.422,55.3653],"Rotation":0},{"Text":"48","TextBB":[739.134,94.0076,743.381,96.7876],"Rotation":0},{"Text":"9","TextBB":[507.809,98.9613,510.654,102.579],"Rotation":0},{"Text":"40","TextBB":[699.374,97.1942,703.62,99.9743],"Rotation":0},{"Text":"16","TextBB":[540.24,99.7511,545.952,103.368],"Rotation":0},{"Text":"19","TextBB":[503.542,109.821,509.254,113.439],"Rotation":0},{"Text":"14","TextBB":[543.084,110.019,548.797,113.636],"Rotation":0},{"Text":"3","TextBB":[525.731,111.204,528.576,114.821],"Rotation":0},{"Text":"44","TextBB":[749.498,107.817,753.744,110.597],"Rotation":0},{"Text":"43","TextBB":[700.854,109.486,705.101,112.266],"Rotation":0},{"Text":"34","TextBB":[720.523,115.859,724.77,118.639],"Rotation":0},{"Text":"39","TextBB":[617.737,117.984,621.984,120.764],"Rotation":0},{"Text":"10","TextBB":[535.119,122.064,540.831,125.681],"Rotation":0},{"Text":"8","TextBB":[522.602,126.803,525.447,130.42],"Rotation":0},{"Text":"17","TextBB":[592.299,129.172,598.011,132.79],"Rotation":0},{"Text":"36","TextBB":[750.132,129.365,754.379,132.145],"Rotation":0},{"Text":"31","TextBB":[678.436,136.801,682.682,139.581],"Rotation":0},{"Text":"4","TextBB":[493.586,136.873,496.43,140.49],"Rotation":0},{"Text":"38","TextBB":[719.043,140.746,723.289,143.526],"Rotation":0},{"Text":"46","TextBB":[652.845,87.0271,657.092,89.8072],"Rotation":0},{"Text":"11","TextBB":[489.318,88.1012,494.826,91.7186],"Rotation":0},{"Text":"33","TextBB":[762.61,77.9221,766.857,80.7022],"Rotation":0},{"Text":"7","TextBB":[535.119,78.4258,537.964,82.0432],"Rotation":0},{"Text":"29","TextBB":[702.123,147.271,706.37,150.052],"Rotation":0},{"Text":"1","TextBB":[479.931,148.326,482.775,151.943],"Rotation":0},{"Text":"13","TextBB":[450.345,169.651,456.057,173.268],"Rotation":0},{"Text":"37","TextBB":[705.93,170.792,710.177,173.572],"Rotation":0},{"Text":"(a)","TextBB":[470.667,180.224,486.987,191.495],"Rotation":0},{"Text":"Good","TextBB":[491.343,180.224,521.786,191.495],"Rotation":0},{"Text":"result","TextBB":[526.343,180.224,557.612,191.495],"Rotation":0},{"Text":"set","TextBB":[561.968,180.224,577.6,191.495],"Rotation":0},{"Text":"(b)","TextBB":[640.789,180.224,657.941,191.495],"Rotation":0},{"Text":"Poor","TextBB":[662.13,180.224,688.493,191.495],"Rotation":0},{"Text":"result","TextBB":[692.987,180.224,724.256,191.495],"Rotation":0},{"Text":"set","TextBB":[728.613,180.224,744.244,191.495],"Rotation":0}],"Mention":["The ﬁrst task we consider is the classiﬁcation of good (top\n20) versus poor (bottom 20) result sets. For this task, we\nused the explicit relevance judgments described in 3.2. For\neach query, we order the search results from best to worst\nusing the human judgments. We note that this ordering can\nbe diﬀerent than the output of the search engine.\nWe then project the top 20 search results, and bottom\n20 results ordered by human judgments onto the URL and\ndomain graphs, and compute the features described in ta-\nble 1 for the two graphs. We learn a model that can predict,\nfor a previously unseen query with a set of search results,\nwhether it is good (top 20) or poor (bottom 20). Given the\naverage number of judged search results per query, we are\neﬀectively learning to discriminate the top 20 results versus\nthe search results with ranks 40 to 60. Note that this task\ninvolves predicting the relative quality of results for a given\nquery. We examine predicting the absolute quality of the\nresults in the next section.\nFirst, we point to Figure 5 which displays examples of pro-\njections of good and poor result sets for the query medline\non the domain graph. We can see that results in a good set\nare tightly clustered, while those in the poor result set are\nmore spread out, requiring many connection nodes to con-\nnect the components of the projection graph. Also notice\nthat the results marked by humans as most relevant (dark-\nest nodes) appear as the central (high-degree) nodes in the\ngraph (Figure 5(a)). Similarly, Figure 6 shows the good and\npoor result sets for the query Wisconsin projected on the\nURL graph. The central node in the good result set (panel\na) is one of the search results, whereas in poor set (panel b)\nthe central node is a derived connector node.\nTable 2 shows the results for the task of predicting good\nversus poor result sets using several diﬀerent methods and\n","centric features from the projection and connection graphs,\nincluding those describing the position of the node with re-\ngard to the rest of the graph. These node-centric features\ncan then be used to train existing ranking algorithms (e.g.,\nRankNet). Another application of our work is to discover\nmissing human relevance scores. Given a projection graph\nwhere we have human relevance judgments for a few nodes,\nwe would like to predict the judgments that would be as-\nsigned to the rest of the nodes.\nAnother promising direction for research is exploring the\nrole of the connector nodes. We used these nodes to connect\ndisconnected components of the projection graph. How-\never, we observed that the connector nodes often become\nhubs holding the network together. As an example, see Fig-\nure 5(b) where the central connector node is a hub. How-\never, there are also cases where no such patterns emerge,\n(e.g., Figure 6(b)). To explore these questions, a better\nunderstanding of the quality of our heuristics to connect\ncomponents of projection graph is needed. In the anal-\nyses described, we used a greedy heuristic that randomly\nchooses connections from the set of competing paths of the\nsame length. We do not yet understand the sensitivity this\nheuristic in the overall procedure for selecting nodes.\nWith regard to modeling users and their queries, we are\nexcited about exploring clusters of queries and query tran-\nsitions based on graphical properties of their projection and\nconnection graphs. The rich evidential patterns provided by\ngraph-theoretic features promise to be valuable in describing\ndiﬀerent characteristics of queries, determining the classes of\nqueries, and mapping query transitions to these classes.\nOne could also apply the ideas for modeling web searchers’\nbehaviors in other ways. Web projections might be used\nto construct predictive models that infer paths that the\nsearchers will likely take when reformulating a query from\nan initial query. Predictive models could be used to suggest\nlikely query reformulations, specializations, generalizations\nand avoid transitions that would not likely lead to good sets\nof results, as captured by the graphical properties of projec-\ntions associated with the sets.\nOther applications include using the graph projections to\nexplore the dynamics and evolution of the web, where mod-\nels learned from features capturing topology and topological\ndynamics could help us to understand how sites and pages\nthat created or removed over time relate to the rest of the\nweb. Such models promise to be valuable in predicting the\nconceptual links and quality of new content and sites.\nWe believe that the represented work captures a starting\npoint with the use of web projections. We found that the\nmethods complement existing textual and graphical analyses\nand provoke tantalizing questions and interesting directions\nfor future research in web search and retrieval, including ef-\nforts on enhancing result quality and on better understand-\ning and supporting human behavior. We hope that the ideas\nwill be of value to others pursuing insights about the nature\nand use of graphical properties of the web.\n"],"Page":5,"Number":6,"Type":"Figure","CaptionBB":[438,206,772,234],"Height":1100,"Width":850,"DPI":100,"ImageBB":[446,40,778,194]}