{"Caption":"Figure 3. Input frames are stacked along the time axis to form a space-time volume. Given frames captured with a video camera panning clockwise, panoramic mosaics can be obtained by pasting together vertical strips taken from each image. Pasting together strips from the right side of the images will generate a panoramic image where all regions appear as they first enter the sequence, regardless of their chronological time. ","ImageText":[],"Mention":["Panoramic dynamosaics may be generated using the\napproach described above with the time slices shown in\nFig. 2b. Assuming that the camera is scanning the scene\nleft-to-right, the first mosaic in the sequence will be con-\nstructed from strips taken from the right side of each input\nframe, showing regions as they first appear in the field of\nview (see Fig. 3). The last mosaic in the resulting sequence\nwill be the mosaic image generated from the strips on the\nleft, just before a region disappears from the field of view.\nBetween these two extreme slices of the space-time volume\nwe use intermediate panoramic images that are represented\nby time slices moving smoothly from the first slice to the\nlast slice. These slices are panoramic images, advancing\nalong the local time from the appearance slice to the dis-\nappearance slice, where the local dynamics of each region\nis preserved. Fig. 1 shows a single panorama from such a\nmovie.\n","Sometimes it is more convenient to use an alternative\nrepresentation of the space-time volume as used in Fig. 13.\nIn this representation, the world coordinates (u; v) are re-\nplaced with the image coordinates (x; y). The camera mo-\ntion is represented by re-spacing the space time volume ac-\ncording to the location of the camera along the u axis [11].\nAlthough the first representation is technically more cor-\nrect, the latter one might be easier to implement, especially\nwhen the velocity of the camera varies from frame to frame.\nIn the image coordinate system, for example, dynamosaic\npanoramic movies correspond to parallel vertical slices of\nthe (x; y; u) space-time volume.\n"],"Page":3,"Number":3,"Type":"Figure","CaptionBB":[427,247,757,352],"Height":1100,"Width":850,"DPI":100,"ImageBB":[455,33,735,234]}