{"Caption":"Figure 1: An example of two sequential cycles with the gate delays labeled. The lower set of registers {x, y, z} forms the critical cycle and will limit the clock period after sequential optimization. How- ever, a static timing-driven tool will incorrectly target path c → x, likely at the expense of other paths. ","ImageText":[{"Text":"out","TextBB":[349.457,82.3754,362.29,91.4127],"Rotation":0},{"Text":"in","TextBB":[116.218,134.089,124.03,143.126],"Rotation":0},{"Text":"4","TextBB":[144.055,134.925,149.075,143.963],"Rotation":0},{"Text":"x","TextBB":[170.887,132.136,175.346,141.173],"Rotation":0},{"Text":"1","TextBB":[254.733,103.239,259.753,112.276],"Rotation":0},{"Text":"c","TextBB":[286.364,96.9917,290.822,106.029],"Rotation":0},{"Text":"4","TextBB":[315.037,98.2186,320.058,107.256],"Rotation":0},{"Text":"a","TextBB":[233.646,98.2195,238.667,107.257],"Rotation":0},{"Text":"6","TextBB":[202.016,123.824,207.037,132.861],"Rotation":0},{"Text":"y","TextBB":[231.136,144.689,235.594,153.726],"Rotation":0},{"Text":"6","TextBB":[257.299,148.704,262.32,157.742],"Rotation":0},{"Text":"z","TextBB":[283.853,144.689,287.759,153.726],"Rotation":0},{"Text":"2","TextBB":[312.75,149.206,317.771,158.244],"Rotation":0}],"Mention":["The use of inappropriate timing information to guide the place-\nment process can have deleterious effects for the final design per-\nformance. If we reconsider the example in Figure 1, a decision to\nshorten path c→ x at the expense of y→ z appears to be beneficial\nfrom a static timing standpoint, however doing so would actually\nresult in an increase in the clock period after sequential optimiza-\ntion. Our experimental results, shown at the end of this paper in\nTable 1, indicate that this effect is demonstrably present in several\nindustrial designs; timing-driven placement indeed yields a design\nwith a smaller clock period before sequential optimization, but hav-\ning a larger final clock period after sequential optimization, in some\ncases even worse than what could be achieved without any timing\noptimization at all. Our research addresses this problem. Instead of\nsimply trying to correct the results of combinational timing anal-\nysis, however, we attempt to fully exploit the potential of in-place\nretiming and clock skew scheduling.\n","With the availability of in-place retiming or clock skew schedul-\ning, the wires that limit the achievable clock period after sequential\noptimization are not necessarily the ones that limit the clock pe-\nriod beforehand. Figure 1 shows a simple sequential circuit. It is\nclear that without any changes to the clocking, path c→ x is period-\nlimiting. However, if the relative arrival of the clock at registers a\nand c can be moved by 1 delay unit backward and 3 delay units\nforward, respectively, the paths between x, y, and z will limit the\n"],"Page":2,"Number":1,"Type":"Figure","CaptionBB":[73,184,407,258],"Height":1100,"Width":850,"DPI":100,"ImageBB":[114,75,365,177]}