{"Caption":"Figure 1. a) original image of size 321 × 481, b) local geodesics up to geodesic radius α = 100 around the point (50, 400), c) local geodesics up to geodesic radius α = 300. d) Global geodesics for the whole image. ","ImageText":[{"Text":"(a)","TextBB":[149.679,215.138,161.966,225.034],"Rotation":0},{"Text":"(b)","TextBB":[300.483,215.138,313.39,225.034],"Rotation":0},{"Text":"(c)","TextBB":[149.679,346.912,161.966,356.808],"Rotation":0},{"Text":"(d)","TextBB":[300.483,346.912,313.39,356.808],"Rotation":0}],"Mention":["pixels.\nOur approach in this paper combines all these ideas in\na very natural and mathematically sound way. As can be\nseen, intervening contours and other rules used in calculat-\ning similarities can be thought of as a crude way of estimat-\ning geodesics on a suitable manifold. Here we introduce a\nmore formal way of estimating geodesics on an image. In-\ntuitively our method can be explained as follows: 1) First an\nedge strength function is generated from the pixel features\n(gray-scale, color or texture). Values of this edge function\nrepresent the cost of crossing a pixel when connecting two\npixels along a shortest path. We make sure that there is a\nminimum cost everywhere even if the edge strength is zero.\nThis is to reduce the similarity if two pixels are spatially\ndistant. 2) Calculate geodesics from each pixel to all pix-\nels. Pairwise similarity is then a monotonically decreasing\nfunction with respect to the geodesic distances. In Fig. 1 the\nbehavior with increasing geodesic radius is demonstrated.\nWithout loss of generality, in the rest of the paper, we fo-\ncus our analysis and discussion to normalized cuts method\ndue to its popularity. In principle, algorithms and methods\nwe introduce in this paper are independent of the graph par-\ntitioning method used.\nThe rest of the paper is organized as follows. In Sec-\ntion 2 we review Fast Marching Method [6] and our imple-\nmentation of it. In Section 3 we introduce an extension of\nFast Marching to calculate all-pairs geodesics and discuss\nhow we generate pairwise similarities from geodesics. Sec-\ntion 4 compares our methods with the previous methods of\ngenerating similarities and show some image segmentation\nresults. In Section 5 we introduce our multi resolution ap-\nproach. We conclude in Section 6.\n"],"Page":2,"Number":1,"Type":"Figure","CaptionBB":[68,362,398,422],"Height":1100,"Width":850,"DPI":100,"ImageBB":[82,104,386,358]}