{"Caption":"Figure 1: Complementary CDF for the Number of Other Visible Nodes Associated with Each Visible Node ","ImageText":[{"Text":"CCDF","TextBB":[78.7324,283.757,91.9721,313.456],"Rotation":3},{"Text":"of","TextBB":[78.7324,271.865,91.9721,280.784],"Rotation":3},{"Text":"Visible","TextBB":[78.7324,237.397,91.9721,268.892],"Rotation":3},{"Text":"Nodes","TextBB":[78.7324,203.517,91.9721,234.424],"Rotation":3},{"Text":"0.8","TextBB":[107.926,191.823,122.792,205.063],"Rotation":0},{"Text":"alledge-adns","TextBB":[292.615,191.823,353.841,205.063],"Rotation":0},{"Text":"alledge-domain","TextBB":[280.733,202.518,353.841,215.758],"Rotation":0},{"Text":"alledge-server","TextBB":[286.092,213.212,353.841,226.452],"Rotation":0},{"Text":"0.6","TextBB":[107.926,231.83,122.792,245.07],"Rotation":0},{"Text":"0.4","TextBB":[107.926,271.886,122.792,285.126],"Rotation":0},{"Text":"0.2","TextBB":[107.926,311.893,122.792,325.133],"Rotation":0},{"Text":"0","TextBB":[116.846,351.9,122.792,365.14],"Rotation":0},{"Text":"0","TextBB":[127.722,362.594,133.668,375.834],"Rotation":0},{"Text":"100","TextBB":[168.005,362.594,185.843,375.834],"Rotation":0},{"Text":"200","TextBB":[214.186,362.594,232.024,375.834],"Rotation":0},{"Text":"300","TextBB":[260.415,362.594,278.253,375.834],"Rotation":0},{"Text":"400","TextBB":[306.644,362.594,324.482,375.834],"Rotation":0},{"Text":"500","TextBB":[352.824,362.594,370.663,375.834],"Rotation":0},{"Text":"1","TextBB":[116.846,151.817,122.792,165.056],"Rotation":0}],"Mention":["Our initial work on generating a privacy footprint for a\nset of pages focused on the dataset of popular sites from 13\nAlexa categories. The pages in this set are served by 1075\nservers (visible), which when accessed, cause an additional\n2926 unique (hidden) servers to be accessed.\nWe \frst compute the number of associated visible nodes\nfor each visible node to get an idea of connectedness in the\ngraph. Two visible nodes are associated if they each are con-\nnected via an edge to a common hidden node. This \\server\"\napproach of using the server name for each hidden node\nfails to capture obvious organizational relationships amongst\nthe hidden nodes. In our \\domain\" approach, hidden node\nservers with the same 2nd-level domain are merged into a\nsingle hidden node1. Visible nodes are not merged.\nUsing the 2nd-level name for combining servers within the\nsame organization does not correctly capture all such rela-\ntionships. Two frequently occurring hidden domain nodes\nare google-analytics.com and googlesyndication.com|\nnodes from the same organization, but not the same second\nlevel domain. We also found cases where what appeared\nto be a server in one organization (e.g. lads.myspace.com)\nwas actually a DNS CNAME alias to a server (e.g. lads.\nmyspace.com.edgesuite.net) in another organization (e.g.\nAkamai). We found these type relationships could be cap-\ntured with an \\adns\" approach where all hidden nodes shar-\ning the same set of authoritative DNS servers (ADNSs) were\nmerged into a single hidden node.\nTo better understand whether this adns approach cor-\nrectly groups servers of the same organization or if it leads\nto false positive errors, we examined the servers contained\nwithin the top-15 most frequently occurring ADNSs. The\ntop-15 account for more than half of the ADNSs handling\nmultiple servers. Doing spot checks on servers from these\ntop-15 ADNSs using DNS lookup tools, WHOIS, traceroute\nand clustering analysis we observed an error rate of around\n5% where servers from di\u000Berent organizations use the same\nADNS.\nUsing the three approaches, Figure 1 shows a comple-\nmentary CDF with the number of associations for all 1075\nvisible nodes. Along the y-axis, the results show that 61%\nof these visible nodes are associated with at least one other\nvisible node using hidden nodes denoted by individual server\nnames. When these hidden nodes are merged according to\ntheir domain then 72% of the visible nodes are associated\nwith at least one other visible node, and when hidden nodes\nare merged according to their ADNS then this percentage\ngrows to 82%. Along the x-axis, the results show a max-\nimum of 338 (31%) associations for a single visible node\nunder the server approach, a maximum of 443 (41%) asso-\nciations under the domain approach and a maximum of 609\n(57%) associations under the ADNS approach. The graph\nshows that over 60% of all visible nodes have associations\nwith more than 100 other visible nodes using the ADNS ap-\nproach. The breadth and the depth of these results indicates\na signi\fcant number of relationships between popular Web\nsites visited by users that can be tracked via common, but\ntypically hidden, servers in the Internet.\nWe next examine hidden nodes and the degree to which\n","Thus far, we have shown that both the extent of associ-\nations between visible nodes and the concentration of these\nassociations via hidden nodes is signi\fcant. We now sum-\nmarize these measures on interconnectedness. We generate\na \\privacy footprint\" intended to not only summarize the\nconnectivity for a given set of sites, but to be used as a ba-\nsis of comparison for di\u000Berent results. The footprint needs to\ncapture the important metrics from the graphs in Figures 1\nand 2. The metrics and their justi\fcation for inclusion in\nthe footprint are:\n","2. The distribution (median, mean, max) of the number\nof visible node associations for a given visible nodes.\nThis metric captures the CCDF of Figure 1 and rep-\nresents the depth of the associations|do visible nodes\nhave relatively few or many associations?\n","The \frst three lines in Table 3 simply summarize data in\nFigures 1 and 2 with the last three lines in the table showing\nthe same metrics for data gathered six months earlier for the\nsame set of sites. The results show that while the number\nof visible nodes with associations has increased roughly 5%\nacross the three approaches, the metrics for the number of\nassociations for a visible node have increased roughly 50%\nfor the mean indicating a signi\fcant increase in the associ-\nations via the hidden nodes. The concentration of associa-\ntions among the top-10 hidden nodes has increased roughly\n20% for the adns and domain merger approaches. The large\nincrease in these metrics indicates a growing potential to\ntrack and correlate user activity across seemingly unrelated\nWeb sites on the Internet.\n"],"Page":3,"Number":1,"Type":"Figure","CaptionBB":[73,408,407,451],"Height":1169,"Width":826,"DPI":100,"ImageBB":[78,152,415,391]}