{"Caption":"Figure 2: Top left two: reference and matching images. Top right two: ground truth x and y motion ﬁeld. Bottom left two: interpolated LP motion estimation. Bottom right two: interpolated graph cut motion estimation. ","ImageText":[],"Mention":["In this section, we present the results of the linear program-\nming based motion estimation method in the application of\nmotion estimation and stereo problems. In all the following\nexperiments, we use only the gray scale image for feature\nextraction and matching. If the image is a color image, it\nwill be ﬁrst converted to a gray level image before further\nprocessing. The gray level image is also normalized such\nthat the gray levels are in [0,1].\nFirst, we compare the proposed LP based method with\nthe graph-cut method, the state of art benchmark global op-\ntimization scheme. To simplify the comparison, we ignore\nocclusion in these experiments for both methods. As well,\nwe use the same cost function and topology for both meth-\nods. About 800 random points are selected in a rectangu-\nlar area and weighting parameters are tuned such that the\nbest performance in the sense of mean absolute error is at-\ntained for both schemes respectively. Fig. 1 and Fig. 2 show\ntest images used and their ground truth motion ﬁeld and the\nbest-performance interpolated sparse motion estimation re-\nsults for two different experiments. Mean absolute error for\nthe selected points is compared in Fig. 3. For these tests, the\nLP based method has substantially better performance both\nvisually and in the sense of mean absolute error.\nFig. 4 illustrates the sparse linear programming edge-\nfeature points based matching result and dense motion esti-\nmation for image Table. A rectangular region has been se-\nlected as the region of interest manually. About 2000 edge-\npoints and supporting points are detected in the region of in-\nterest. The local searching region is [−20, 20] in both x and\n","We also apply the proposed scheme to the stereo problem\nwith large occlusions. Fig. 10 shows the stereo pair for the\nimage Map with the motion vector plot and occlusion map\nin a polygonal window region of interest. Fig. 11 shows the\ndense disparity map and its texture-mapped image in the\nregion of interest. Fig. 12 shows the dense disparity esti-\nmation without occlusion inference. Comparing the texture\nmapped images of Figs. 11 and 12, we can see that the oc-\nclusion inference improves the motion at the boundary of\nocclusion.\n"],"Page":6,"Number":2,"Type":"Figure","CaptionBB":[439,434,768,493],"Height":1100,"Width":850,"DPI":100,"ImageBB":[447,299,762,420]}