{"Caption":"Figure 1: An ISR system.","ImageText":[{"Text":"Content","TextBB":[554.887,366.945,585.952,375.147],"Rotation":0},{"Text":"servers","TextBB":[588.421,366.945,617.587,375.147],"Rotation":0},{"Text":"Clients","TextBB":[690.354,387.145,717.454,395.347],"Rotation":0},{"Text":"(home)","TextBB":[719.954,387.145,748.107,395.347],"Rotation":0},{"Text":"Clients","TextBB":[440.088,387.612,467.188,395.813],"Rotation":0},{"Text":"(work)","TextBB":[469.688,387.612,494.374,395.813],"Rotation":0},{"Text":"alice","TextBB":[543.487,406.545,561.751,414.747],"Rotation":0},{"Text":"S","TextBB":[440.954,432.411,446.868,440.613],"Rotation":0},{"Text":"winxp","TextBB":[455.087,431.145,477.684,439.347],"Rotation":0},{"Text":"Checkin","TextBB":[491.354,437.278,523.417,445.48],"Rotation":0},{"Text":"(upload)","TextBB":[491.088,448.011,523.64,456.213],"Rotation":0},{"Text":"bob","TextBB":[578.887,406.145,593.684,414.347],"Rotation":0},{"Text":"chuck","TextBB":[610.154,406.078,633.387,414.28],"Rotation":0},{"Text":"linux","TextBB":[565.621,430.278,583.854,438.48],"Rotation":0},{"Text":"winxp","TextBB":[589.554,430.278,612.151,438.48],"Rotation":0},{"Text":"v","TextBB":[575.021,452.745,579.454,460.947],"Rotation":0},{"Text":"1","TextBB":[579.488,456.907,582.898,462.581],"Rotation":0},{"Text":",","TextBB":[582.888,452.745,585.353,460.947],"Rotation":0},{"Text":"…,","TextBB":[587.821,452.745,599.219,460.947],"Rotation":0},{"Text":"v","TextBB":[601.688,452.745,606.121,460.947],"Rotation":0},{"Text":"n-1","TextBB":[606.154,456.907,615.031,462.581],"Rotation":0},{"Text":",","TextBB":[615.021,452.745,617.486,460.947],"Rotation":0},{"Text":"v","TextBB":[619.954,452.745,624.387,460.947],"Rotation":0},{"Text":"n","TextBB":[624.421,456.907,627.831,462.581],"Rotation":0},{"Text":"Checkout","TextBB":[659.421,436.545,696.952,444.747],"Rotation":0},{"Text":"(download)","TextBB":[656.221,447.212,700.107,455.413],"Rotation":0},{"Text":"winxp","TextBB":[710.354,431.078,732.951,439.28],"Rotation":0},{"Text":"D","TextBB":[740.021,430.745,746.423,438.946],"Rotation":0}],"Mention":["Each client host in the ISR system runs a VM moni-\ntor that can load and execute any parcel. ISR provides\na mechanism for suspending and transferring the execu-\ntion of these parcels from one client host to another. For\nexample, Figure 1 shows a scenario where a user trans-\nfers the execution of a VM instance from a source host S\nat the office to a destination host D at home.\n","load size to 293 MB for Delta and 132 MB for ALL.\nFurther, CAS policies provide the most significant ben-\nefits where they are needed most, for large upload sizes.\nFrom Figure 11(b) we see that CAS improves small up-\nload operations by a modest 20 to 25 percent, while from\nFigure 11(c), we see that CAS improves the performance\nof large uploads by a factor of 2 to 5 without compres-\nsion, and by a factor of 1.5 to 3 with compression. Thus,\nwe observe that CAS significantly reduces the volume of\ndata transmitted during upload operations, and hence the\nwait time experienced at the end of a user session.\n","CAS outperforms compression. Figure 11(a) indi-\ncates that the ALL policy without compression outper-\nforms the Delta policy with compression for chunk sizes\nless than 64 KB (as does the IP policy at a 4 KB chunk\nsize). This shows that for our application, inter-chunk\nCAS techniques may identify and eliminate more re-\ndundancy than traditional intra-chunk compression tech-\nniques. The difference may be substantial, particularly\nwhen the upload size is large. As Figure 11(c) shows,\nthe ALL policy without compression (chunksize=4 KB)\noutperforms the Delta policy with compression (chunk-\nsize=512 KB) by a factor of 4.\nIP identifies both temporal and spatial redundancy.\nFor each of the components of Figure 10, we see that the\nIP policy consistently outperforms the Delta policy. Both\nof these policies restrict the search space for redundancy\n","from Figure 10 are presented along with average upload\nsizes in Figure 11. Note that the median upload sizes tend\nto be substantially better than the mean sizes, indicating\nthat the tail of the distribution is somewhat skewed in\nthat the user will see a smaller than average upload sizes\nfor 50% of the upload attempts. Even so, we see from\nFigure 11(c) that the tail is not so unwieldy as to present\nsizes more than a factor of 2 to 4 over the average upload\nsize 95% of the time.\nFigure 11(a) shows that, for the 128 KB chunksize\nused in the deployment, the use of CAS reduces the aver-\nage upload size from 880 MB (Delta policy) to 340 MB\n(ALL policy). The use of compression reduces the up-\n","Smaller chunksize is better for CAS. Figure 11(a)\nshows very clearly that smaller chunksizes result in more\nefficient upload transmission for CAS policies. In fact,\nunder the ALL policy, users with 4 KB chunk sizes will\nexperience average upload sizes that are approximately\none-half the average size experienced by users with a\n128 KB chunk size (whether compression is employed\nor not).\n","ALL identifies inter-parcel savings. In all of Fig-\nure 10, the common observation between an IP and ALL\ncomparison is that the ALL policy consistently outper-\nforms the IP policy. This observation is consistent with\nour intuition that for upload operations, the ALL policy\nmust perform at least as well as the IP policy because\nthe ALL policy identifies redundancy within the set of\nblocks visible to the IP policy as well as blocks in other\nparcels. In fact, Figure 11(a) indicates that the ALL pol-\nicy performs about twice as well as the IP policy for\nsmall chunk sizes and approximately 25 percent better\nat larger chunk sizes.\n","Chunk sizes of 4 KB turned out to be optimal for all\npolicies when considering the average upload size. How-\never, chunksize plays a very limited role for the non-CAS\n(Delta) policy, and Figure 11(c) indicates that smaller\nchunk sizes may even be a liability for transfer size out-\nliers under the Delta policy with compression.\n"],"Page":2,"Number":1,"Type":"Figure","CaptionBB":[521,499,665,513],"Height":1100,"Width":850,"DPI":100,"ImageBB":[438,364,750,481]}