{"Caption":"Figure 2: The probability p of joining a DBLP community as a function of the number of friends k already in the community. Error bars represent two standard errors. ","ImageText":[{"Text":"Probability","TextBB":[503.386,372.933,528.905,377.99],"Rotation":0},{"Text":"of","TextBB":[530.424,372.933,534.984,377.99],"Rotation":0},{"Text":"joining","TextBB":[536.504,372.933,552.303,377.99],"Rotation":0},{"Text":"a","TextBB":[553.822,372.933,556.862,377.99],"Rotation":0},{"Text":"conference","TextBB":[558.382,372.933,585.426,377.99],"Rotation":0},{"Text":"when","TextBB":[586.946,372.933,600.012,377.99],"Rotation":0},{"Text":"k","TextBB":[601.531,372.933,604.265,377.99],"Rotation":0},{"Text":"coauthors","TextBB":[605.785,372.933,629.789,377.99],"Rotation":0},{"Text":"are","TextBB":[631.309,372.933,639.209,377.99],"Rotation":0},{"Text":"already","TextBB":[640.728,372.933,658.654,377.99],"Rotation":0},{"Text":"’members’","TextBB":[660.174,372.933,685.381,377.99],"Rotation":0},{"Text":"of","TextBB":[686.901,372.933,691.461,377.99],"Rotation":0},{"Text":"that","TextBB":[692.98,372.933,702.099,377.99],"Rotation":0},{"Text":"conference","TextBB":[703.619,372.933,730.663,377.99],"Rotation":0},{"Text":"0.1","TextBB":[485.781,381.135,493.38,386.191],"Rotation":0},{"Text":"0.08","TextBB":[482.742,413.935,493.38,418.991],"Rotation":0},{"Text":"0.06","TextBB":[482.742,446.736,493.38,451.793],"Rotation":0},{"Text":"probability","TextBB":[468.864,452.781,473.921,477.693],"Rotation":3},{"Text":"0.04","TextBB":[482.742,479.537,493.38,484.594],"Rotation":0},{"Text":"0.02","TextBB":[482.742,512.337,493.38,517.394],"Rotation":0},{"Text":"0","TextBB":[490.341,545.139,493.38,550.196],"Rotation":0},{"Text":"0","TextBB":[495.9,550.605,498.94,555.662],"Rotation":0},{"Text":"2","TextBB":[522.649,550.605,525.688,555.662],"Rotation":0},{"Text":"4","TextBB":[549.396,550.605,552.436,555.662],"Rotation":0},{"Text":"6","TextBB":[576.145,550.605,579.184,555.662],"Rotation":0},{"Text":"8","TextBB":[602.893,550.605,605.933,555.662],"Rotation":0},{"Text":"10","TextBB":[628.082,550.605,634.161,555.662],"Rotation":0},{"Text":"12","TextBB":[654.831,550.605,660.91,555.662],"Rotation":0},{"Text":"14","TextBB":[681.579,550.605,687.659,555.662],"Rotation":0},{"Text":"16","TextBB":[708.328,550.605,714.407,555.662],"Rotation":0},{"Text":"18","TextBB":[735.077,550.605,741.156,555.662],"Rotation":0},{"Text":"k","TextBB":[615.64,558.805,618.374,563.862],"Rotation":0}],"Mention":["An underlying premise in diffusion studies is that an individual’s\nprobability of adopting a new behavior increases with the number\nof friends already engaging in the behavior — in this case, the num-\nber of friends already in the community.\nIn Figures 1 and 2 we show this basic relationship for LJ and\nDBLP respectively: the proportion P (k) of people who join a com-\nmunity as a function of the number k of their friends who are al-\nready members. For LJ, this is computed as follows.\n","Relation toMathematicalModels of Diffusion. There are a num-\nber of theoretical models for the diffusion of a new behavior in a\nsocial network, based on simple mechanisms in which the behav-\nior spreads contagiously across edges; see for example [12, 21, 34]\nfor references. Many of these models operate in regimented time\nsteps: at each step, the nodes that have already adopted the behavior\nmay have a given probability of “infecting” their neighbors; or each\nnode may have a given threshold d, and it will adopt the behavior\nonce d of its neighbors have adopted it.\nNow, it is an interesting question to consider how these models\nare related to the empirical data in Figures 1 and 2. The theoretical\nmodels posit very simple dynamics by which influence is transmit-\nted: in each time step, each node assesses the states of its neighbors\nin some fashion, and then takes action based on this information.\nThe spread of a real behavior, of course, is more complicated, and\nour measurements of LJ and DBLP illustrate this: we observe the\nbehavior of an individual node u’s friends in one snapshot, and\nthen u’s own behavior in the next, but we do not know (i) when or\nwhether u became aware of these friends’ behavior, (ii) how long\nit took for this awareness to translate into a decision by u to act,\nand (iii) how long it took u to actually act after making this deci-\nsion. (Imagine, for example, a scenario in which u decides to join a\ncommunity after seeing two friends join, but by the time u actually\njoins, three more of her friends have joined as well.) Moreover,\nfor any given individual in the LJ and DBLP data, we do not know\nhow far along processes (i), (ii), and (iii) are at the time of the first\nsnapshot — that is, we do not know how much of the information\ncontained in the first snapshot was already known to the individ-\nual, how much they observed in the interval between the first and\nsecond snapshots, and how much they never observed.\nThese considerations help clarify what the curves in Figures 1\nand 2 are telling us. The concrete property they capture is the mea-\n","It is informative to look at which features are being used at the\ntop-level splits made by the decision trees. Figure 5 shows the top 2\nsplits installed by a representative tree. While the features and splits\nin the tree varied depending on the sample, the top 2 splits were\nquite stable, with only minor variations between samples. The first\nof these is the fraction of people that have a large number of friends\nin the community. Given the results of the previous section, this is\nintuitively natural. At the top level, we see that communities having\na higher percentage of fringe members with at least 13 friends in\nthe community are much more likely to be of class 1. Furthermore,\n"],"Page":3,"Number":2,"Type":"Figure","CaptionBB":[438,579,772,622],"Height":1100,"Width":850,"DPI":100,"ImageBB":[466,370,743,564]}