{"Caption":"Figure 3: Case-use ratio for CHEBR-Exact and CHEBR- Region ","ImageText":[],"Mention":["until a spike within the last 100 games.\nAlthough not demonstrated in the figures, CHEBR-\nExact’s current checkers game play is competitive in the\nearly to mid portion of each game played. CHEBR-Exact’s\nquality of moves late in the game, especially with a small\ncase library, deteriorates due to the great number of permu-\ntations of board configurations and a low ratio of these per-\nmutations represented in the case library. As CHEBR-Exact\nis trained longer and allowed to expand its case base, checker\ngame play improves. These results are consistent with pre-\nvious results (Sinclair 1998) that argue that larger case bases\nare required to fully represent diverse scenarios which are\ncommonly encountered towards the end of game play.\nOverfitting is a natural concern when training CBR sys-\ntems for a long time. The results in Figure 2 do not seem\nto illustrate a convergence that could be caused by an over-\ntraining effect in which an agent learns to repeatedly apply\na small set of effective moves against a particular opponent.\nNote, however, the spike in the case-use ratio for CHEBR-\nExact in Figure 3 within the last 100 games. This spike\nsuggests either overtraining or that CHEBR-Exact is quickly\nfinding a technique for winning against CHEBR-Region.\nIt appears that CHEBR-Exact requires more games of\ntraining to effectively learn checkers play. It is further\nbelieved that if CHEBR-Exact were allowed to compete\nagainst multiple opponents in the initial stages of its train-\ning, CHEBR-Exact might be better able to learn different\ngame play strategies employed by a variety of opponents.\nThis could be accomplished by allowing an inexperienced\nCHEBR-Exact agent to compete against a set of other com-\nputer players, each capable of utilizing their own distinct\nstratagems.\n"],"Page":4,"Number":3,"Type":"Figure","CaptionBB":[86,682,419,712],"Height":1100,"Width":850,"DPI":100,"ImageBB":[89,509,417,666]}