{"Caption":"Figure 2: Flow In The Middle (FIM) example","ImageText":[{"Text":"b","TextBB":[248.107,145.049,252.684,153.561],"Rotation":0},{"Text":"a","TextBB":[125.315,192.113,129.379,200.625],"Rotation":0},{"Text":"A","TextBB":[189.261,191.662,195.87,200.174],"Rotation":0},{"Text":"B","TextBB":[246.799,196.391,252.905,204.903],"Rotation":0},{"Text":"C","TextBB":[287.992,193.013,294.097,201.526],"Rotation":0},{"Text":"c","TextBB":[352.722,192.338,356.787,200.85],"Rotation":0},{"Text":"(a)","TextBB":[184.833,231.328,198.647,242.536],"Rotation":0},{"Text":"Example","TextBB":[201.833,231.328,246.029,242.536],"Rotation":0},{"Text":"Topology","TextBB":[249.167,231.328,296.393,242.536],"Rotation":0},{"Text":"Aa","TextBB":[124.167,286.901,131.698,296.914],"Rotation":0},{"Text":"t","TextBB":[358.304,288.421,359.741,296.431],"Rotation":0},{"Text":"Bb","TextBB":[124.167,320.278,131.704,330.291],"Rotation":0},{"Text":"t","TextBB":[358.304,321.797,359.741,329.808],"Rotation":0},{"Text":"Cc","TextBB":[124.167,359.218,131.342,369.231],"Rotation":0},{"Text":"t","TextBB":[358.304,360.738,359.741,368.748],"Rotation":0},{"Text":"(b)","TextBB":[135,409.494,149.48,420.702],"Rotation":0},{"Text":"Channel","TextBB":[153.333,409.494,194.629,420.702],"Rotation":0},{"Text":"activity","TextBB":[198.667,409.494,235.727,420.702],"Rotation":0},{"Text":"sensed","TextBB":[239.5,409.494,272.56,420.702],"Rotation":0},{"Text":"by","TextBB":[276.667,409.494,289.06,420.702],"Rotation":0},{"Text":"the","TextBB":[293,409.494,308.196,420.702],"Rotation":0},{"Text":"middle","TextBB":[312,409.494,346.529,420.702],"Rotation":0},{"Text":"flow.","TextBB":[135,421.828,159.113,433.036],"Rotation":0}],"Mention":["Flow-in-the-Middle (FIM). The FIM problem arises when the\nsender of a flow senses the activity of neighboring nodes that are\nnot within range with respect to each other. This behavior is il-\nlustrated in the three-link scenario of Fig. 2. If all flows are back-\nlogged, the middle flowBbwill receive very low throughput, while\nthe outer flows (Aa and Cc) will receive maximum throughput.\nThis is not due to high loss probability, but rather to the lack of\ntransmission opportunities for the middle flow. More specifically,\nwhen one of the outer flows (say flow Aa) captures the medium,\nthe transmitter of the middle flow Bb will sense and defer but the\ntransmitter of the other outer flow Cc will continue contending and\ninitiate transmission. When flowAa ends transmission, it will con-\ntend and initiate transmission, while flow Bb now defers due to\nflow Cc. Fig. 2(b) shows that the misaligned concurrent transmis-\nsions of the outer flows may be sensed by the transmitter B of the\nmiddle flow for extended periods of time. The middle flow has a\nchance to access the medium only when both outer flows are in the\nback-off phase (the vertical lines interval in Fig. 2(b)). Unfortu-\n","For convenience, in the rest of the paper we use the term “ad-\nvantaged flows” to refer to flows with geometry advantage (such as\nflow Bb in Fig. 1(a) and the outer flows Aa and Cc in Fig. 2(a))\nand the term “disadvantaged flows” to refer to flows with geometry\ndisadvantage (such as flow Aa in Fig. 1(a) and flow Bb in Fig.\n2(a)). We also maintain the convention of using capital letter for\nthe transmitter and lowercase letter for the receiver of each flow.\n","Single-channel starvation scenarios. We first investigate the\nability of AMCP and MMAC to address the IA and FIM coordina-\ntion problems (Fig. 1 and Fig. 2, respectively). These scenarios can\neasily be addressed by random channel selection if a large number\nof channels are available. Here we consider the case when a total\nof three channels are available.\nWe observe from Fig. 11(a) that AMCP provides equal and max-\nimum throughput to each flow, despite that, topologically, flow Bb\nhas more information about the channel. Furthermore, the simula-\ntion shows that the two flows persist transmitting on different chan-\nnels. This is a desired property and shows that AMCP successfully\nseparates the two flows and reduces their interaction.\nUnder MMAC, flowBb achieves 80% the maximum throughput\nof 802.11 and AMCP. This is the maximum throughput allowed\nby MMAC since the ATIM window is 20% of the beacon period.\nHowever, the key observation is that the disadvantaged flow Aa\nreceives only 2\/3 of the maximum MMAC throughput. This is be-\ncause the IA problem still exists in both the control subframe and\nthe data subframe: the ATIM packet size is comparable to the back-\n","(a) IA scenario (Fig. 1(a)). 1 and 2 denote\nflow Aa and Bb, respectively.\n","(b) FIM scenario (Fig. 2(a)). 1, 2 and 3\ndenote flow Aa, Bb and Cc, respectively.\n","subject to random channel selection: in this case, the transmitter of\nthe middle flow is not able to decode the colliding ATIM control\npackets of the outer flows.\nWe now explain how AMCP addresses the IA and FIM prob-\nlems. In the IA scenario, flow Bb does not experience collisions\nand will persist transmitting on one of the two data channels (e.g.\nchannel 1). The receiver of flow Aa will be informed about this\ndecision through the control packets of flow Bb. The transmitter\nA of flow Aa starts without any knowledge of which channel to\nuse. Since contention in the control channel has been reduced by\nthe removal of data packets, it is easier for A to access the receiver.\nIn case it picked channel 1, A will be informed by the receiver\nand will compete and acquire channel 2 in its next access attempt.\nAfter that point both flows will continue transmitting on different\nchannels.\nIn the FIM scenario flows do not experience collisions and there-\nfore prefer to transmit on the same channel. Since the outer flows\nare not within range there may be an undesirable situation where\nthey have preference for channels 1 and 2, respectively. In this case\nthe middle flow Bb is blocked but only temporarily, until its chan-\nnel timers expire. It will then contend on the control channel for any\nof the two data channels. When it acquires any of the two channels\n(e.g. channel 1) the outer flows are informed and will compete for\nchannel 2. From this point on, since the flows do not experience\ncollisions they will continue transmitting on orthogonal channels.\nArbitrary topology \/ single-hop flows. We now consider an ar-\nbitrary topology of 100 nodes placed in a 2000m × 2000m area.\nThe nodes are arbitrarily divided in 50 disjoint single-hop flows.\nFig. 12 depicts the per-flow throughput under AMCP, MMAC,\n"],"Page":3,"Number":2,"Type":"Figure","CaptionBB":[118,458,361,471],"Height":1100,"Width":850,"DPI":100,"ImageBB":[122,142,362,433]}