{"Caption":"Figure 3: The Ten Most Informative Patches. The ten rectan- gles on each object show the top ten patches our algorithm selected for the classification cascade for that object. The face model seems to prefer features around the eyes, while the car models tend to like wheels. Notice, however, that even within a category each cascade is unique, highlighting interesting appearance features for that ob- ject. The patches are color coded according to their order, from dark red (1) to dark blue (10). ","ImageText":[],"Mention":["produce an object-speci\u0002c cascade with the \u0002rst test based\non the patch containing the door handle. Whereas for Jen's\nFord, the same set of hyper-features will result in a different\nordering of salient patches, resulting in a different classi\u0002-\ncation cascade with the \u0002rst test using a patch containing the\nroof rack (see Fig. 3).\n","4. applying early termination thresholds to the patch se-\nquence to create the cascade.\nWe tested our algorithm on two different data sets: (1)\ncars from 2 cameras with signi\u0002cant pose differential, and\n(2) faces from news photographs. Examples from these two\ndata sets are shown in Figure 3, with the top 10 patches of the\nclassi\u0002cation cascade, and Figure 4, with model-test classi-\n\u0002cation results. For each data set, a different automatic pre-\nprocessing step was applied to detect objects and approxi-\nmately align them. After this, the same identi\u0002cation algo-\nrithm was applied to both sets. For lack of space, we de-\ntail our experiments on data set 1, and only summarize the\nresults for data set 2. Qualitatively, our results are consis-\ntent in showing that each of the above aspects of our sys-\ntem improves the performance, and that the overall system\nis both ef\u0002cient and effective. In the last section, we com-\npare our system to Lowe's technique [9], which does not use\ncategory-speci\u0002c learning.\n"],"Page":4,"Number":3,"Type":"Figure","CaptionBB":[435,527,768,661],"Height":1169,"Width":826,"DPI":100,"ImageBB":[436,370,771,513]}