{"Caption":"Figure 3: (a) Overhead and number of covered pages, (b) fraction of new pages covered, (c) 90% cover statistics. ","ImageText":[],"Mention":["For each site at each time, we construct the bipartite\ngraph H and employ Greedy to cover all new pages. Fig-\nure 2 plots a point for each site, each timestep, and each\npartial cover (i.e., for a cover of size 10, we show a point\nfor the first node of the cover, the first two nodes, and\nso forth—each successive partial cover captures more nodes\nwith higher overhead than the previous partial cover). A\npoint at location (x, y) represents a cover of size x that cov-\ners y new pages. The figure represents approximately 400\ntrajectories, one for each site at each timestep, but many of\nthese are overlapping; the lower graph of the figure shows a\nbreakout of the smaller trajectories at a larger scale.2\nThe graph clearly shows the diminishing returns as each\ncover grows. Further, an examination of the knee of the\ncurves shows that most covers efficiently capture 90% of the\ntotal new pages, but must work much harder to cover the\nremaining 10%.\nWe present a detailed aggregation of these numbers in\nFigure 3(a-b). We perform an experiment in which we em-\nploy Greedy for a particular site at a particular time, but\nterminate processing when either all new pages have been\ncovered, or the current cover has reached a certain size k;\nthis corresponds to the k-budgeted cover problem. In Fig-\nure 3(a-b), the x-axis represents the threshold k that is the\nmaximum size cover we will employ for any site\/time pair.\n","the nature of covers that capture at least 90% of the new\npages for a give site\/time pair. Figure 3(c) is a scatter plot\nshowing a detailed breakout of this information. A point at\n(x, y) means that a particular site at a particular time had\na cover of size x that covered y new pages.\nAs algorithm Greedy adds a page only when it results\nin the discovery of at least one page of new content, there\nare no points below the line y = x. The figure is promising\nto the extent that there is a significant mass of points far\nfrom the line. Note that the figure is shown in log-log scale,\nand there are clearly numerous points in which a small cover\nproduces a large number of new pages.\nWe may ask about the distribution of sizes of these 90%\ncovers. Figure 4 shows this distribution as a histogram,\nshowing the number of site\/time pairs for which the 90%\ncover has a certain absolute size. Small covers of five or\nfewer pages suffice to capture 90% of the new content of\nmost sites, but for a nontrivial number of sites, covers of\nmore than a hundred pages are required. No site in our\nsample ever required a 90% cover of more than one thousand\npages.\n"],"Page":5,"Number":3,"Type":"Figure","CaptionBB":[73,272,772,300],"Height":1100,"Width":850,"DPI":100,"ImageBB":[88,78,764,243]}