{"Caption":"Figure 2: (a) Team assignment accuracy for STABR comparing agglomerative clustering with RANSAC on the scenario shown in Figure 1. Clearly proximity-based clustering is ineffective when agent formations are in close proximity. (b) Pruning team assignment hypotheses based on spatio-temporal behavior recognition drastically reduces the number of hypotheses that STABR considers. The number of hypotheses that remain after pruning closely follows the actual size of the consistent partitions. ","ImageText":[],"Mention":["nario with 16 agents. In Figure 1(a), 12 of the agents are\narrayed in three teams of four agents in a square forma-\n","ses from which world-states need to be generated. Since\nthe execution time of STABR’s last stage can grow expo-\nnentially with the size of this hypothesis set, it is impor-\ntant to reduce the set of team assignment hypotheses (with-\nout jeopardizing accuracy). Figure 2(b) shows (in semi-log\nscale) the size of the hypothesis set before and after spatio-\ntemporal pruning along with the actual size of the consistent\nset (which is not actually known until stage 3). As can be\nseen, the spatio-temporal behavior recognition dramatically\nreduces the number of hypotheses that need to be considered\nby the third stage — without adversely affecting accuracy.\n","for each agent, at every time-step. Our evaluation metrics\nare summarized below:\n1. team assignment accuracy: We score, at each time-step,\nwhether the team assignment for each agent is correct. We\nemploy a conservative metric and require the team mem-\nberships to match exactly; e.g., the absence of a single\nagent in a k-member team counts as k errors — one for\neach of the incorrectly-labeled agents — rather than a sin-\ngle assignment error. Team assignment accuracy is plot-\nted over time (Figure 2(a)) to show results on a particular\nscenario and averaged over the scenario to generate ag-\ngregate results (Table 1).\n2. behavior recognition accuracy: This measures the qual-\nity of behavior recognition and is computed in an analo-\ngous manner as team assignment accuracy, using the same\nconservative metric.\n3. hypothesis set size: We examine the number of hy-\npotheses that are considered by STABR during various\nstages. This enables us to assess the contribution of\nspatio-temporal pruning.\nEach of the following experiments examines a particular as-\npect of STABR to better understand its contributions. In\nall of these experiments, the STABR parameters were set\nto β = τ = 1 and γ=0.1, unless otherwise specified.\nThe first experiment evaluates the benefits of employing\nthe RANSAC-based formation template approach to identi-\nfying teams against a standard proximity-based clustering.\nK-means and agglomerative clustering are two popular un-\nsupervised clustering methods (Duda, Hart, & Stork 2001)\nthat are frequently employed to group agents into teams.\nSince the former requires that the number of clusters be\nexternally-specified, we chose to compare STABR against\nthe latter. In this experiment, the first stage of STABR\nis replaced with agglomerative clustering, where groups of\nproximal agents were aggregated into teams. Figure 2(a)\npresents the team assignment accuracy for both algorithms\non the scenario shown in Figure 1. Agglomerative clustering\nand RANSAC both perform well when the agent teams are\nwell-separated. However, as the formations begin to inter-\nleave, the accuracy of agglomerative clustering deteriorates\nrapidly. This is because agents that are proximal should fre-\nquently be assigned to different teams. The transient drop in\naccuracy near t = 50 corresponds to frames where 12 agents\nsimultaneously transition from three groups of 4 agents to\nfour groups of 3 agents over the span of a few frames; al-\nthough either assignment would be correct during this inter-\nval, the ground truth file arbitrarily selects a single transition\npoint, and STABR’s explanation is marked as incorrect. Re-\nsults on behavior recognition (not shown) mirror those for\nteam assignment, since correctly identifying an agent’s be-\nhavior generally requires the algorithm to also group it into\nthe correct team.\nTable 1 summarizes the agent team assignment accuracy\nfor STABR over several scenarios. While proximity-based\nclustering can handle the simplest scenario, it copes poorly\nwith the interleaved formations in more complex scenarios.\nThe second experiment studies the contribution of the\nspatio-temporal behavior recognition, not in terms of accu-\nracy but rather in terms of reducing the number of hypothe-\n"],"Page":6,"Number":2,"Type":"Figure","CaptionBB":[73,326,775,389],"Height":1100,"Width":850,"DPI":100,"ImageBB":[106,82,740,327]}